{
  "current": {
    "version": "0.1.1600.7513",
    "date": "2018-08-17T00:00:00+01:00"
  },
  "history": [
    {
      "version": "0.1.1597.7508",
      "notes": [
        "Added Water Canister to Portable Hydroponics on new world start.",
        "Reduced amount of water that spawns with a Water Canister.",
        "Added first pass of setting prefab attributes through modding. There is now a new XML type \"ThingModData\" which is a list inside \"ThingMods\" in GameData. This allows you to overwrite prefab values that were previously hardcoded in the prefabs. So far, variables on Thing, DynamicThing, Item, Food, GasCanister, and BatteryCell have been exposed. An example mod is included in the game folder (StreamingAssets\\AttributesExampleMod.zip), as well as on the workshop (don't run while playing the game, it makes eggs unusable in recipes). Note that over time more and more attributes will be exposed, allowing you to mod more and more of the game."
      ]
    },
    {
      "version": "0.1.1596.7504",
      "notes": [
        "Added Portable Hydroponics. A dynamic item that contains four planting slots, and a gas canister slot. Provided as part of the starting supplies, and also constructable from a kit produced from Pipe Bender. Allows growing plants in a dynamic object that can be carried around. Still requires sunlight. Can be wrenched onto a connector.",
        "Fixed mining drill being audible at far beyond it's intended sound range.",
        "Fixed Batteries having their power stored value being set to NaN and rendering the battery non functional.",
        "Fixed collision damage not taking angle into account. You should no longer receive damage if sliding down a slope.",
        "Reverted some changes intended to increase performance that may have been causing issues (exploding canisters)"
      ]
    },
    {
      "version": "0.1.1593.7496",
      "notes": [
        "Fixed some scenario objects not being cleaned up properly preventing you from completing objectives if you restarted a scenario without relaunching the game."
      ]
    },
    {
      "version": "0.1.1592.7494",
      "notes": [
        "Fixed bug with Scenarios looking to the wrong file path for the starting condition definitions XML file.",
        "Added Hardsuit Jetpack. Has increased capacity (forteen slots) as well as full jetpack functionality and increased environmental protection for contents. Constructable from the Tool Manufactory.",
        "Added Hardsuit Backpack. This has more slots, but no jetpack capability. Constructable from the Tool Manufactory. Useful where you want more storage space but don't require jetpack.",
        "Refactored mineables pool. Modest reduction in garbage collection."
      ]
    },
    {
      "version": "0.1.1590.7487",
      "notes": [
        "Fixed bug that prevented placing Face items.",
        "Fixed Save/Loading of Scenarios so that they properly restore stage and objective states."
      ]
    },
    {
      "version": "0.1.1587.7479",
      "notes": [
        "Fixed wrong rice texture was used. Resulted in green rice and weird plant textures. Now correct texture used so rice is white."
      ]
    },
    {
      "version": "0.1.1586.7476",
      "notes": [
        "Added Pumpkin. Provides a lot of nutrition but grows slowly. Can be turned into Pumpkin Pie with other ingredients.",
        "Added Rice. Grows fast but does not provide much nutrition. Will be used in future recipes.",
        "Added mushrooms. Do not require sunlight to grow, but take much longer than other plants to mature. Gives roughly the same nutrition as an uncooked potato."
      ]
    },
    {
      "version": "0.1.1585.7466",
      "notes": [
        "Fixed Index Out Of Range error caused by GetPercentageString if a status update percentage went over 200.",
        "Improvement Garbage collection improvements to Jetpack.",
        "Fixed ConsoleMonitor Autorotate bug.",
        "Improvement Autorotate now works with Transformer",
        "Improvement Autorotate now works with TorpedoTube",
        "Improvement Autorotate now works with Unloader, ToolManufactory, and VendingMachine.",
        "Improvement Autorotate now (theoretically) works with TankSmallAir and TankSmallFuel.",
        "Improvement Autorotate now works with TankBig and TankSmall",
        "Improvement Autorotate now works with SuitStorage",
        "Improvement Autorotate now works with StellarAnchor",
        "Improvement Autorotate now works with StackerReverse.",
        "Improvement Autorotate now works with Stacker",
        "Rereverted addition of Autorotate to Gyroscope, Cryotube and HydraulicPipeBender"
      ]
    },
    {
      "version": "0.1.1582.7450",
      "notes": [
        "Reverted addition of Autorotate to Gyroscope, Cryotube and HydraulicPipeBender due Unity issues preventing build from finishing.",
        "Fixed AreaPowerControl consuming power but not adding that power to the inserted battery if it was powered off."
      ]
    },
    {
      "version": "0.1.1581.7447",
      "notes": [
        "Improvement Autorotate now works with Sorter",
        "Improvement Autorotate now works with SolidFuelGenerator",
        "Improvement Autorotate now works with Sleeper",
        "Improvement Autorotate now works with SecurityPrinter",
        "Improvement Autorotate now works with the rocket engines",
        "Improvement Autorotate now works with Recycler",
        "Improvement Autorotate now works with OrganicsPrinter",
        "Improvement Autorotate now works with HydroponicsStation",
        "Improvement Autorotate now works with HydraulicPipeBender",
        "Improvement Autorotate now works with Gyroscope",
        "Fixed Log and Pow logic math functions were using Input2 twice, instead of Input1, Input2.  Should now be using both inputs correctly.",
        "Improvement Autorotate now works with GasTankStorage",
        "Improvement Autorotate now works with GasGenerator",
        "Improvement Autorotate now works with Furnace",
        "Improvement Autorotate now works with Fabricator",
        "Fixed credits button taking you to the scenarios menu.",
        "Improvement Autorotate now works with ElectronicsPrinter",
        "Improvement Autorotate now woks with CryoTube",
        "Fix Attachment connection directions on AirConditioner"
      ]
    },
    {
      "version": "0.1.1573.7410",
      "notes": [
        "Improvement Autorotate now works with Computer",
        "Improvement Autorotate now works with Contrifuge",
        "Improvement Autorotate now works with Bench, Chair, and Control Chair",
        "Improvement Autorotate now works with Battery",
        "Improvement Autorotate now works with Autolathe.",
        "Improvement Autorotate now works with Arc Furnace"
      ]
    },
    {
      "version": "0.1.1571.7399",
      "notes": [
        "Improvement Autorotate now works with Tank Connector.",
        "Improvement Autorotate now works with SolarPanels.",
        "Improvement Autorotate now works with PowerConnector.",
        "Improvement Autorotate now works with Air Conditioner, Electrolyzer, and Filtration",
        "Improvement Autorotate now works with GasMixer",
        "Improvement Autorotate now works with Beacon"
      ]
    },
    {
      "version": "0.1.1570.7392",
      "notes": [
        "Improvement Autorotate now works with AreaPowerControl.",
        "Improvement Autorotate now works with ActiveVent",
        "Improvement Autorotate works with LED; Wall Light; DiodeSlide; and Wall Light Long Wide, Long Angled, and Long.",
        "Improvement Autorotate works with Conveyor Corner, Straight Long, Straight, Straight Short and Riser.",
        "Improvement Extended Autorotate to work with grid objects that can't rotate in any direction."
      ]
    },
    {
      "version": "0.1.1568.7383",
      "notes": [
        "Added Scenario Menu.  No official scenarios are included yet, but support for workshop scenarios has been enabled.  This will be better detailed in the next patch and documentation on how to build your own scenario will be provided in the #modding channel in Discord when it's ready.  The Scenario button will be disabled if no valid scenarios are detected in your enabled mods."
      ]
    },
    {
      "version": "0.1.1567.7381",
      "notes": [
        "Fixed not being able to climb on ladders if they were placed below 0 on the Y axis.",
        "Fixed a bug where if you clear a item blueprint aligned to a mothership then bring another blueprint up without moving the new one won't be aligned to the mothership axes but otherwise acts as though it is.",
        "Fixed Autorotate not finding all options on Mothership Grid",
        "Fixed Autorotate not adjusting rotations for Mothership Grid",
        "Fixed Holding or tapping the autorotate key while moving between world grid and mothership grid would sometimes cause the placement to not align with the grid",
        "Updated Localization entries for French, Italian, Portuguese, Russian, Simplified Chinese, Traditional Chinese, Suomi and Spanish.",
        "Changed ratio of Carbon obtained from putting Coal into the Reagent Grinder from 5:1 to 1:10.",
        "Fixed NullReferenceException on jetpacks not belonging to players, or players not wearing jetpacks."
      ]
    },
    {
      "version": "0.1.1563.7371",
      "notes": [
        "Fixed Ore orientation randomly changing while being mined by changing the shake effecting position to rotation",
        "Changed handling of reagent mixes in the Recycler and Centrifuge to try and reduce instances of machine inventories growing exponentially.",
        "Added lateral movement even when height efficiency is low.",
        "Fixed bug causing jetpack stabilization not working while using the labeller.",
        "Changed QuantityUsed value for Soy Oil and all Color reagents to 1 from 5 and 10 respectively.",
        "Fixed jetpacks sending to many messages."
      ]
    },
    {
      "version": "0.1.1562.7363",
      "notes": [
        "Increased amount of Soy Oil returned per soy bean processed in the reagent grinder.",
        "Reduced cost of paint recipes.",
        "Added Flower recipes to Organics printer in case you need to replace starting supply in survival.",
        "Fixed Red Flower thumbnail now shows a red flower instead of a yellow one."
      ]
    },
    {
      "version": "0.1.1561.7357",
      "notes": [
        "Fixed Attempted to reduce instances of NaN batteries in cold environments.  Should also clear their broken state on save load.",
        "Updated Localization files for German, Italian, Russian, Simplified Chinese, Traditional Chinese, Spanish and Suomi (Finnish).",
        "Fixed issue preventing placement of cables directly behind the Elevator.",
        "Fixed issue causing null reference exceptions when trying to use the Solid Fuel Generator due to missing GeneratorOre value.",
        "Fixed flickering placement for facemount objects."
      ]
    },
    {
      "version": "0.1.1560.7350",
      "notes": [
        "Added additional organics crate to default starting conditions. Includes flowers, and more food.",
        "Replaced set of Road Flares in Construction Crate in default start with an Advanced Airlock Circuitboard.",
        "Added Medium and Heavy variants of gas filters. Medium filters last five times as long as the normal filters. Heavy filters last 20 times as long as the normal filters. They can be constructed on the Atmos Printer (Pipe Bender).",
        "Removed Paint from being made at the tool manufactory. Now this is done by the Paint Mixer appliance.",
        "Added Paint Mixer appliance. Use color dyes and soy oil mixed together to make the various spray cans. Make this appliance on the Electronics Printer or the Fabricator.",
        "Added Colored Flowers. Grow these and then grind them up in the Reagent Processor to produce dyes for making paints.",
        "Fixed Angled console placement."
      ]
    },
    {
      "version": "0.1.1558.7334",
      "notes": [
        "Fixed custom key assignments not saving correctly.",
        "Fixed Elevator placement erroring when placed in same voxel as a wall.",
        "added z axis padding on the prefab so that it correctly registered as occupying 2 voxels.",
        "added ConConstruct checks so that the voxel with the carriage in it does the structure style checks and the voxel with the back end in it does wall style checks. However because ElevatorShaft can't inherit from Wall directly, and the CanConstruct checks in Structure are override'n and ignored in Device this is quite messy IMO. Could probably do with consideration of a better way to do it at some point.",
        "Fixed Angled console so that it is free mount again.",
        "Fixed issue with new world screen entries being duplicated if coming from the workshop screen."
      ]
    },
    {
      "version": "0.1.1557.7324",
      "notes": [
        "Fixed issue with drag-and-drop thumbnails and drag-to-slot."
      ]
    },
    {
      "version": "0.1.1556.7321",
      "notes": [
        "First pass on new exploding mechanics. Explosions now apply brute and stun damage.",
        "Improvement Can autorotate Console Monitor, LED (Small, Medium, and Large), Dual and Console."
      ]
    },
    {
      "version": "0.1.1554.7312",
      "notes": [
        "Improvement Logic Memory now uses Autorotate.",
        "Added player will automatically take off when turn jetpack on",
        "Added Mission Event trigger for plant growth states.",
        "Improvement Added autorotate to pipe/cable mounted objects."
      ]
    },
    {
      "version": "0.1.1553.7304",
      "notes": [
        "Fixed top placement bug for FaceMount'able objects."
      ]
    },
    {
      "version": "0.1.1552.7302",
      "notes": [
        "Updated translations for several languages.",
        "Added Finnish translations.",
        "Improvement Added Automatic Rotate to WallLight.",
        "Improvement Added SmartRotate to WallHeater",
        "Improvement Implemented AutomaticRotate for WallCooler.",
        "Improvement SmartRotate implemented for TransformerSmall and TransformerSmallReversed",
        "Improvement added Automaticrotate to RTG.",
        "Improvement SmartRotate implemented for flashing light.",
        "Improvement Automatic Rotate works with Logic Compare, Math, Unary, Min/Max, and Select.",
        "Improvement Automatic rotate applied to Logic Button, Lever, Switch, and Dial.",
        "Improvement Automatic Rotation implemented for ReagentReader, BatchReader, SlotReader, LogicMirror, BatchWriter, LogicWriter, LogicReader, and BatchSlotReader.",
        "Improvement Automatic Rotate works for Igniter.",
        "Improvement Automatic rotate implemented on Daylight, Gas, and Motion Sensor.",
        "Improvement Console works with automatic Rotate",
        "New Feature Automatic Rotation implemented for FaceMounted objects.",
        "Fixed missing shake effect on ores caused by terrain refactor"
      ]
    },
    {
      "version": "0.1.1550.7285",
      "notes": [
        "Fixed Jetpack Caution notification not occurring, only jetpack critical."
      ]
    },
    {
      "version": "0.1.1549.7283",
      "notes": [
        "Added kit for Portable Tank creation in the pipe bender, rather than making the tank itself as it tended to clip out and fly around.",
        "Fixed not able to crowbar elevator open and closed.",
        "Added logic values for tanks and battery to Suit Storage."
      ]
    },
    {
      "version": "0.1.1548.7281",
      "notes": [
        "Added Trigger Plate. Activates a value or activates logic when something is within the trigger zone. Constructable from Kit (Trigger Plate) manufactured on the Electronics Printer.",
        "Fixed cereal bar using 150g of flour instead of 50g.",
        "Fixed constant drain of propellant when in zero gravity environments."
      ]
    },
    {
      "version": "0.1.1546.7274",
      "notes": [
        "Added ability to use logic to read Quantity value from Pipe Analyzer which will return TotalMoles for the attached pipe network. [Thanks JeepGuy]"
      ]
    },
    {
      "version": "0.1.1545.7272",
      "notes": [
        "Fixed Switching hand to an empty slot while using the mining drill resulting in a null error requiring a restart to resolve.",
        "Fixed Inability to launch tutorial due to corrupt translation file."
      ]
    },
    {
      "version": "0.1.1543.7267",
      "notes": [
        "Fixed incorrect atmosphere unit settings on gas canister, portable generator, scrubber, gas sensor, and generator."
      ]
    },
    {
      "version": "0.1.1540.7263",
      "notes": [
        "Fixed Pipe Meter, Pipe Analyser, and Gas Generator reporting in incorrect units.",
        "Added advanced airlock control circuitboard. Allows assignment of an internal and external door, with a matching internal and external pump. You can set the internal and external pressure that will be met. When cycling the circuitboard will completely clear the room with its designated vent, before refilling the room with the designated pump. Useful for airlocks in environments where you have matching, but different, atmospheres instead of vacuums.",
        "Fixed gas filters providing too much when recycled.",
        "Updated translation text for Spanish, Japanese, Russian, Simplified Chinese, Traditional Chinese. [Thanks socramazibi, YuanYu, -Ulitka- and lill in Discord]",
        "Updated Tutorial translations for Japanese and Traditional Chinese [Thanks lill and YuanYu]",
        "Added Italian language option [Grazie Mekko]",
        "Fixed NullReferenceException when placing an elevator due to linked sound issue.",
        "Fixed Airlock Control would open/close doors randomly on network changes and power loss. Now will initialize with it's previous state.",
        "Fixed rotation of battery charger and active vent."
      ]
    },
    {
      "version": "0.1.1536.7250",
      "notes": [
        "Added Batch Slot Reader. Works the same as the Slot Reader, but reads data from the selected slot and variable of all of a device type. Has the Average, Sum, Max, and Min methods of batch reading.",
        "Fixed bug with Batch Reader not sending correct network message for update. Could have resulted in visual desync issues with Batch Reader settings for clients.",
        "Added chunk render distance (configurable setting). This turns off chunks that are not close to you, offering significant performance improvement. Changing the settings slider affects how far chunks are rendered, so you can configure the distance to best suit your computer specifications.",
        "refactored chunk mesh generation to improve performance",
        "Fixed recycling gas filters produces too much reagents.",
        "Fixed able to world interact with objects while dragging items in and out of world inventory.",
        "Fixed Filtration Machine filtered connections are confusing. Now the filtered connections are labelled \"filtered\", \"unfiltered\", and \"input\". Strings have also been made available to localization.",
        "Fixed Construction Cursors not being correctly cancelled if removing the constructor from the active hand slot using the InventorySelect key (default F).",
        "Fixed stacker would produce zero percent filters when splitting. Now this cannot happen, however Gas Filters are also now disabled from having their quantity changed by the stacker anyway."
      ]
    },
    {
      "version": "0.1.1534.7235",
      "notes": [
        "Added first pass of mouse control of world slots and interactions. With mouse control enabled, you can now directly interact with slots and interactables in the world. Such as opening a crate, and swapping items in your inventory with it.",
        "Added Filtration Machines and Suits will not display Filter error state for a used up filter, if another filter of the same type that is not used up exists."
      ]
    },
    {
      "version": "0.1.1533.7233",
      "notes": [
        "Added small locker. This holds only four slots, and is constructed as a variant of Kit (Locker).",
        "Changed Kit (Locker) to use 2 kits when constructing the large locker, small locker will only use 1 kit.",
        "Fixed issue where construction cursor could remain up despite changing hands, dropping the construction kit or moving it using the mouse.",
        "Added voice notifications for Jetpack, Air Tank, and Filters.",
        "Fixed voice notifications running on load of the game.",
        "Fixed World atmosphere being created when deconstruction a grid, causing room to get very cold on Europa.",
        "Fixed issue with pipes not exploding at high pressures due to a change in random chance calculation.",
        "Added Ladder End and Ladder Platform, buildable off the Ladder kit. Place these to have intermediary floors you can get off at. Press jump key to get off at intermediate floors. Ladder end makes it easier to get on a ladder above a ladder platform.",
        "Fixed ladders launching you forward when you get off them.",
        "Fixed incorrect radian conversion with new math functions.",
        "Fixed coal not outputting any gas when used in the solid generator. Now outputs hot CO2 and pollutant when used in solid gen.",
        "Changed Logic Math and Unary Math to take in degrees, not radians. They were previously changed to output degrees, but they were still taking in radians. Now you will need to pass in degrees and you will also get out degrees.",
        "Fixed Orientation of screens on angled consoles.",
        "Fixed exceptions when connecting to dedicated server."
      ]
    },
    {
      "version": "0.1.1528.7213",
      "notes": [
        "Added sound effects to elevator.",
        "Adjusted jump to provide a more consistent result.",
        "Fixed getting struck after jumping or walking, often on the edge of frames, or the edge of objects (such as containers)."
      ]
    },
    {
      "version": "0.1.1526.7209",
      "notes": [
        "Fixed not enough reagents in tutorial to complete recipe creation task.",
        "Added sounds to jetpack for movement.",
        "Fixed bug when reverb not set correctly for items on load or player join server. Now reverb is correctly set when loading into a helmet.",
        "Added warning and critical status indicators for Air Tank low, when wearing a suit. Voice notifications to follow later.",
        "Fixed slight drift on jetpack when stabilizer active. Now stabilizer will keep the player stationary to the best of it's ability.",
        "Fixed when adding reagents to microwave (or chem station) when below the use quantity, the full quantity was added. Now scales reagents added if quantity is below use quantity.",
        "Improvement VolumePump now works with Automatic Rotate",
        "Improvement Automatic Rotate now works with Pressure Regulators.",
        "Added Unloader. Will empty all slots of the provided item. Constructed from stacker kit.",
        "Removed unloading ability from stacker.",
        "Changed fern reagent to Fenoxitone.",
        "Improvement Passive Vent can now use Automatic Rotation",
        "Fixed Gas Filters would continue to exist even after being negative, achieved by putting them in the Arc Furnace.",
        "Fixed Battery and Battery Cells could go into negative with quantity of energy. Now clamped so they will not dip below zero and then take much longer to charge.",
        "Improvement Automatic Rotate works with Hydroponics Tray.",
        "Improvement Automatic Rotation added to Digital Valves and Valves."
      ]
    },
    {
      "version": "0.1.1524.7196",
      "notes": [
        "Added filter caution and critical visual warnings (audio to be recorded). Will show when suit worn that does not contain a filter or contains empty or low filters.",
        "Fixed Nutrition full indicator would get stuck on warning indicator."
      ]
    },
    {
      "version": "0.1.1523.7193",
      "notes": [
        "Changed suit to report error when filter used up or if when worn on entity it has a bad atmosphere.",
        "Changed filters to only get used when actually filtering something. If it is not filtering something, it will not degrade.",
        "Added fitration machine and scrubber will now report errors if they contain a filter than is fully spent."
      ]
    },
    {
      "version": "0.1.1522.7190",
      "notes": [
        "Fixed recycling used Filters would output unlimited quantity of materials.",
        "Added can use crowbar to force open unpowered and unlocked elevator level doors.",
        "Fixed suits still using their atmospheric functions while in the suit storage. Now processing will be paused while in suit storage. Suit and helmet atmospheres will also be purged while in suit storage."
      ]
    },
    {
      "version": "0.1.1519.7182",
      "notes": [
        "Changed Gas Filters to be a consumable. Each Gas Filter will last roughly 2 hours. We will introduce different gas filters that will last longer. Once they reach zero they will be useless, but can be recycled.",
        "Fixed batteries in low pressure environments were still taking cold damage at same rate. Now scales down below one atmosphere. This means on mars, the battery loss rate due to cold will be about 3% of what it would be in a cold room or on Europa.",
        "Refactored Reagent Processor and Chemistry station to support new medical recipes. Fern and some ingots can now be ground into powder using the Reagent Processor. This can then be used in the Chemistry Station to make various new recipes for medicine.",
        "Changed quantity for Milk and SoyOil. This will cause old saves to load very low quantities of these. They were changed in line with the refactor of the reagent system.",
        "Added Milk can be made at the Chemistry Station from Potassium Iodide (ground up fern) and Soy Oil.",
        "Added Heal Pill and Stun Pill can be made at Chemistry station from Potassium Iodide, Electrum, Silver, and Invar. Exact recipes look up EReader Cartridge. Note: Powders for minerals must be made using Ingots at the Reagent Grinder.",
        "Changed cereal bar recipe to require 150g of Flour.",
        "Changed Flour, Milk, and SoyOil to display the quantities of their units, not the percentage remaining."
      ]
    },
    {
      "version": "0.1.1518.7180",
      "notes": [
        "Fixed Console Monitor placement bug",
        "Fixed tooltip position becoming offset wrong.",
        "Fixed Turbine Kit and Prefab missing from game.",
        "Changed Cos, Sin, Tan, Asin, Acos, Atan, Atan2 to output in degrees not radians. Note: This will completely change logic if you were basing them on radians.",
        "Fixed respawn breaking inventory for clients and host. Now inventory windows will work correctly even after your body has decayed.",
        "Fixed Chute Outlet now pays attention to both chute and data when using automatic rotation.",
        "Fixed Chute Inlet now pays attention to both Chute and Data for automatic rotation.",
        "Fixed precedence issue with heat convection calculations, heat should no longer erroneously transfer from cold thing to hot atmosphere. (Thanks again, Zaneo!)"
      ]
    },
    {
      "version": "0.1.1517.7172",
      "notes": [
        "Fixed Composite Roll covers breaking logic when placed over top of them, and networks were reset. They would be registered as devices and take over the assignments for the logic. Now they are registered correctly as Other."
      ]
    },
    {
      "version": "0.1.1516.7169",
      "notes": [
        "Moved recipe for Hardsuit and Hardsuit Helmet from Electronics Printer, to the Tool Manufactory.",
        "Added first pass of turbine generator. Generates 90W of energy from 1 atmosphere of pressure moving through it. Moves up to 1 atm per tick, so capable of generating 180W per second.",
        "Changed power consumation rate of Volume pump. It will use power based on it's setting.",
        "Added PowerGenerated logic variable. This reports how much power is being generated currently on the device. Added to the Solid, Gas, and Turbine generators."
      ]
    },
    {
      "version": "0.1.1513.7161",
      "notes": [
        "Fixed cursor tooltip remaining on."
      ]
    },
    {
      "version": "0.1.1511.7157",
      "notes": [
        "Changed Batteries and Battery cells so that they will drain power slowly when in freezing environments. They will still lose power inside other things (such as a suit), but they will lose less power based on how insulated their parent is."
      ]
    },
    {
      "version": "0.1.1510.7155",
      "notes": [
        "Added buff to Portable Air Conditioner. It will now be 5x more effective at heating, but it will use power 5x more in doing so. This simply means it is faster at heating.",
        "Changed Gas Generator to require particular atmospheric operating conditions. A min and max temperature, and a minimum pressure. Outside of these the generator will shut down. Also, it now outputs only some of the combusted energy as power, the rest is outputted as heat into the waste pipe.",
        "Fixed Stacker locking out when filled with over 500 ingots",
        "Fixed Inventory Windows able to be dragged out of bounds. Now cannot drag inventory window outside of window canvas.",
        "Fixed performance issues with rebuilding and merging large networks. Community team on Discord provided a new solution that is very optimized compared to old one. This should reduce the lag when merging large cable, pipe, and chute networks. (Credit: #modding on Discord).",
        "Increased Jump Force slightly. Tapping jump lightly will produce a very small jump. Pressing and hold jump key to do a maximum jump.",
        "Added new modes for solar sensor - horizontal and vertical angles. Mode 1 is horizontal, mode 2 is vertical."
      ]
    },
    {
      "version": "0.1.1508.7137",
      "notes": [
        "Added undock ability for Inventory Windows. Click and drag the window title bar of the window you want to move, and let go where you want it. This slot will always open there now. This will persist with your save. If you would like to redock the window, click the redock button and it will return to its original location. You can reset the window position in the Settings menu if they get off screen for any reason.",
        "Added Close All Windows button, that also indicates what current control binding for it is. Only shows while a window is open.",
        "Added new UI for Inventory Windows.",
        "Added new math functions to Unary Math Logic: Sin, Cos, Tan, Asin, Acos, Atan. Did not imagine people would have needed these but they might come in handy with required trig for different solar angles.",
        "Added new math functions to Math Processor. Atan2 (y = input2, x = input1), Pow, and log just because. Again these will be useful to mathematicians who want to auto orientate their solars.",
        "Added Mining Drill \"flatten\" mode. When turned to flatten, the drill will not destroy terrain lower than the position the player is at. This is useful if you want to perfectly flatten an area around you. Default mode is the current mode. This can be toggled in the interaction menu for the drill."
      ]
    },
    {
      "version": "0.1.1507.7132",
      "notes": [
        "Fixed major bugs with atmosphere and room generation. Sometimes when voxel changes were registered (through mining) in an enclosed space, a global atmosphere was incorrectly created - causing the inhalation of the existing room. A number of checks and balances have been implemented now to prevent this occuring. Note: while mining voxels you may release small pockets of the global atmosphere. This means that you will notice some changes in temperature as you mine areas out, but it should no longer initiate catastrophic loss of rooms. NOTE: known bug is airlocks failing to always initiate room generation."
      ]
    },
    {
      "version": "0.1.1506.7128",
      "notes": [
        "Fixed construction not cancelled when pressing MouseControl, causing bugs. Now construction is cancelled automatically when player activates MouseControl.",
        "Fixed Wall Iron has wrong blueprint grid bounds, was displaying a box in a grid instead of the bounding box of the wall.",
        "Fixed atmospheric exception associated with Pipe bursting. Showed as a \"max lower than min\" error, causing an atmospheric exception that was unrecoverable.",
        "Fixed atmospheres able to be loaded with extreme values. When an error occurs with the atmospheric system, it was possible extreme values could end up stored as junk. Now the game will detect these and strip them on load.",
        "Fixed atmospheres able to exist in invalid locations. For some reason, atmospheres have been able to continue existing when they should not, such as under frames. Now the atmospheric manager will check for these, and schedule them for destruction if needed. This is a bandaid fix, a more elegant solution will come later."
      ]
    },
    {
      "version": "0.1.1505.7124",
      "notes": [
        "Fixed double jumping.",
        "Added scaled environment damage to lungs. Will take damage faster the hotter/colder it is.",
        "Added efficiency to suit based on damage. The more damaged the suit, the less efficiently it will work."
      ]
    },
    {
      "version": "0.1.1504.7122",
      "notes": [
        "Changed Standard spacesuit and helmet will now catch of fire in a hot environment. Used hardsuit in dangerous environments.",
        "Added Headlamp that provides illumination without having to wear a helmet."
      ]
    },
    {
      "version": "0.1.1502.7117",
      "notes": [
        "Tweaked charatcer movement controller, fixing the \"launching\" in air when up against an item or the terrain. Jumping is now also more like how it was. If you are close to the ground, the jump is basically the same on all planets. However, if you jump off terrain into the air it will depend on the gravity of the planet.",
        "Added slot status icons for item on fire, and item leaking.",
        "Added Suit Storage kit to Pipe Bender.",
        "Fixed null ref when loading into a game where no button had previously been scrolled too.",
        "Added a recoil force to firearms that will push you back. Most noticeable in low or zero gravity",
        "Fixed able to interact with export slot on Pipe Bender. Now it is not interactable."
      ]
    },
    {
      "version": "0.1.1500.7110",
      "notes": [
        "Added Microwave and Reagent Processor to Electronics Printer."
      ]
    },
    {
      "version": "0.1.1499.7107",
      "notes": [
        "Added ladder kit to Autolathe."
      ]
    },
    {
      "version": "0.1.1498.7105",
      "notes": [
        "Fixed ladders able to be placed on top of each other. Now must be placed separately. They will not collide with anything else.",
        "Fixed bug with not being able to get off ladders.",
        "Added tooltip to Construction indicating how to use Autoconnect when multiconstructing. Autoconnect how makes an attempt when you first activate it.",
        "Tweaked Hardsuit. Now able to heat/cool up to twice as much as the normal suit, but it will use twice as much energy in doing so.",
        "Added Hardsuit to Electronics Printer, so you can make it there as well."
      ]
    },
    {
      "version": "0.1.1497.7099",
      "notes": [
        "Fixed day was ten times longer than it should have been. Now back to regular settings.",
        "Added Spacesuit creation to Autolathe, to allow replacement spacesuits."
      ]
    },
    {
      "version": "0.1.1496.7096",
      "notes": [
        "Fixed players able to change direction and velocity while flying through the air without using jetpack."
      ]
    },
    {
      "version": "0.1.1495.7094",
      "notes": [
        "Added recipe for 'hard suit' and 'hard suit helmet' to fabricator"
      ]
    },
    {
      "version": "0.1.1494.7092",
      "notes": [
        "Added Trilight Ambient lighting settings for each world, scaled based on current solar strength. This means that nights will remain very dark, but during the day, there will be color specific ambient light in shadowed areas.",
        "Removed helmets auto-flushing (purging their contents) when closed. Now when closed it will still have some of the current atmosphere in it, and you'll need to auto purge.",
        "Fixed powered items would remain powered after their battery was removed. Now check is again correctly applied, was broken due to fixing another bug. This meands portable lights will power off when the battery is removed, as they used too and should - but were not.",
        "Tweaked player movement speeds for both land and with jetpack.",
        "Added height efficiency scale for jetpack. Reduces effectiveness of the jetpack at high altitudes on worlds. Does not apply in space worlds. Does not apply in rooms (so rooms built at altitudes, the jetpack will work. This is done to reduce players travelling to extreme altitudes with the jetpack.",
        "Tweaked Insulation and damage factors for spacesuits. The default suit is not as insulating as previous, but the new hardsuit provides excellent insulation.",
        "Updated Localized translations for Spanish, French, German, Russian and Traditional Chinese.",
        "Fixed wall geometry rotation bug",
        "Fixed edge case where respawning while in a loaded world caused an exception which broke the resetting of user interface.",
        "Fixed UV seam on the Europa's Jupiter.",
        "Fixed Moon not tidally locked to earth.",
        "Fixed Atmospheric Scattering not being correctly set in Main Menu.",
        "Fixed Draggable objects too easy to move around, flying off easily in low gravity environment and glitching too easy. Was caused by mass being set to same as player. These now have five times the mass of the player. This should make them more stable when run into by player.",
        "Added Suit damage variation. Hardsuit absorbs far more damage on collisions than the normal suit. Uniforms also absorb damage. Players will take brute damage to their whole body after suit and uniform is destroyed."
      ]
    },
    {
      "version": "0.1.1493.7078",
      "notes": [
        "Fixed GameMode being overwritten when loading a game. Now all other values are still overwritten, except for GameMode.",
        "Fixed hardsuit materials all messed up as they were a different order from the normal suit, so it didn't show correct painting and status state.",
        "Fixed NullReferenceExceptions on dedicated servers related to skyboxes.",
        "Fixed reflections on mars(and moon) when reflections are on in the settings"
      ]
    },
    {
      "version": "0.1.1492.7067",
      "notes": [
        "Added first pass of Hardsuit & Hardsuit Helmet. Exactly the same functions as the Spacesuit for now. Second pass will have more."
      ]
    },
    {
      "version": "0.1.1491.7065",
      "notes": [
        "Fixed reloading resets harvestable quantity. If you took a potato, saved, and reloaded, you could get three potaoes again instead of one. Now the quantity to harvest is correctly serialized.",
        "Fixed ordering of slots/interactables when scrolling with mousewheel would sometimes be out of order. Now sorting is applied every time a button is added, ensuring that buttons will scroll sequentially when using the mouse wheel."
      ]
    },
    {
      "version": "0.1.1490.7061",
      "notes": [
        "Added planet support to skyboxes. Europa now has Jupiter and the Moon has Earth.",
        "Added solar energy scale. Different worlds will output different levels of solar energy, affecting the efficiency of solar panels and growing plants using sunlight.",
        "Fixed atmosphere hitting absolute zero on mars at night.",
        "Added planetary atmosphere changing depending on time of day. You're now able to define temperature curves in worldsettings.xml",
        "Added path-based localization file parsing.  This means all translation files no longer have to be located in the same folder, allowing translations to be included with mods or custom scenarios.",
        "Added fall-back translations.  Previously if the translation library for a particular language was missing an entry, that entry was replaced with an error string.  It will now use the English version where the version for the current language setting is unavailable.",
        "Added Configurable Voice Notifications. You can now enable/disable individual voice notifications in the Audio settings menu. These are saved with the rest of the game settings.",
        "Updated the terrain shader to support secularity and set the appropriate values for each world type.",
        "Fixed some SmartRotate variables hadn't been set on the prefabs",
        "Readded allowing both radiative and convective heat transfer at the same time.",
        "Fixed can paint StellarAnchor kit, and paint applied to Mothership kit will be applied to structure when placed.",
        "Fixed could not return to game when the leave session popup shown.",
        "Worked with Petr to make some artistic changes to the EuropaIce terrain material",
        "Added so that terrain loads much further bellow the player while up in the air",
        "Improved chunk generation spread like ripple."
      ]
    },
    {
      "version": "0.1.1488.7033",
      "notes": [
        "Fixed nulref when scrolling with mouse wheel (down in particular).",
        "Fixed new world menu kept populating worlds each time you visit it."
      ]
    },
    {
      "version": "0.1.1487.7030",
      "notes": [
        "Fixed missing Europa Skybox (only works on new worlds)."
      ]
    },
    {
      "version": "0.1.1486.7028",
      "notes": [
        "Fixed new character controller not allowing proper jetpack movement in rooms, not jumping well enough in rooms, jumping too far in low gravity, and walking over objects being too strong."
      ]
    },
    {
      "version": "0.1.1485.7025",
      "notes": [
        "Added new world first pass, Europa.",
        "Fixed hunger rate not loading on dedicated servers.",
        "Added color controls to terrain shader for ores"
      ]
    },
    {
      "version": "0.1.1484.7020",
      "notes": [
        "Refactor Character Movement. Important! Character movement when grounded has been moved from force based, to velocity based. This means that the character will no longer feel floaty when walking. When you push a direction to move, your character will move in that direction at the set speed, rather than applying a force in that direction.",
        "Added real world gravity settings for worlds. Now the moon and mars are set to their real world gravity settings. Room gravity will still be applied at as earth gravity. You character will \"stick\" to the world somewhat when moving, so you shouldn't fly off when running around the terrain so long as you are not going too fast.",
        "Fixed issue with starting conditions not being parsed correctly for scenarios.",
        "Added a SmartRotate feature that will attempt to rotate objects only through options that achieve the best matches.",
        "Changed BatteryCharger placement so that it needs to be placed against a surface.",
        "Moved Mouse settings from Misc to Controls settings tab."
      ]
    },
    {
      "version": "0.1.1481.7009",
      "notes": [
        "Added setting for toggling Lens Flares on/off. Default is on."
      ]
    },
    {
      "version": "0.1.1478.7003",
      "notes": [
        "Fixed nulref in inventory. Caused by premature destruction of inventory windows. Now tutorial proceeds, and inventory windows are no longer prematurely destroyed on brain assignment to body.",
        "Fixed world drag to inventory showing incorrect invalid icons. Now world drag is not initated incorrecly when dragging from inventory to inventory.",
        "Fixed chunks updating ore visualizers properly",
        "Fixed error caused when UI tried to set a button as active before any buttons had been created.",
        "Refactored settings system. Largely the end user will not notice many changes, possibly a little faster. Mostly this new system makes it much easier and less prone to bugs for developers to add new settings.",
        "Added Ambient Occlusion setting. This allows users to control the level of ambient occlusion provided by the game, if they are running the game on a lower-end computer they can set it lower. Previously the game has been defaulting to \"ultra\", the highest setting for ambient occlusion. AO helps make the flat color texturing of objects in stationeers \"pop\" and look much nicer."
      ]
    },
    {
      "version": "0.1.1476.6997",
      "notes": [
        "Fixed top of helmet visible after leaving a slot (chair, sleeper etc)."
      ]
    },
    {
      "version": "0.1.1475.6995",
      "notes": [
        "Fixed Possible NullCheckException error when trying to save slot window state, preventing game save.",
        "Reverted changes from recent commits that modified the terrain generation to resolve multiplayer problems"
      ]
    },
    {
      "version": "0.1.1474.6989",
      "notes": [
        "Extended Terrain Generation slightly",
        "Significantly reduced the number of times each chunk needs to be recalculated and applied to chunks.",
        "Fixed more InventoryWindowManager references to stop them running on dedicated server",
        "Fixed With chunks not loading properly if there is only one player connected to a dedicated server",
        "Fixed stacker setting causing exception when set using Logic. Now correctly allows setting via logic without breaking.",
        "Fixed dedicated server issue with InventoryWindowManager being called",
        "Fixed missing reference of InventoryWindowManager in InventoryManager in base scene"
      ]
    },
    {
      "version": "0.1.1472.6976",
      "notes": [
        "Fixed nul ref when changing controls after having played a session and left back to main menu. Was caused by cleanup events being skipped. Now ensured that cleanup events occur, removing old UI windows when players leaves a session."
      ]
    },
    {
      "version": "0.1.1471.6974",
      "notes": [
        "Added category headings to controls assignment menu to provide more clarity.",
        "Added HUD turning on while hovering over HUD scale, to allow you to better configure what HUD scale you want to set.",
        "Added save window placement on exit. Now will reload with the window state when it was saved. Also saves which is the active hand, and what slot was selected with the current highlight.",
        "Refactored control saving and loading. Solved unable to assign defaults for controls after previous refactor.",
        "Added JetPack Stabilizer on/off, includes optional binding to turn on and off.",
        "Added two extra slots to JetPack."
      ]
    },
    {
      "version": "0.1.1470.6969",
      "notes": [
        "Fixed jetpack not allowing movement (beta only).",
        "Added AtmosAnalyser will report if in a room or in world, to help with debugging.",
        "Added hungerRate command to dedicated server RCON"
      ]
    },
    {
      "version": "0.1.1469.6964",
      "notes": [
        "Added optional keybindings for Suit pressure/temperature when worn in suit slot, and jetpack thrust up/down when in Backpack slot.",
        "Added thrust interactables to Jetpack for changing thrust. Displays in the top status what current thrust is.",
        "Fixed thrust unusually strong when using jetpack in gravity environment.",
        "Fixed nulref on certain devices when loading, thanks to active vent fix."
      ]
    },
    {
      "version": "0.1.1467.6960",
      "notes": [
        "Fixed inability to respawn after loading a game in which you're dead.",
        "Fixed Active Vents losing their pipe network, typically when a network they are connected to is merging with a large network (also occurred with engines). Sometimes in a merge their current pipe input network was being nulled when removed was occurring after the add was being processed. Now only nulls if the removed network is their current one.",
        "Fixed Logic Motherboard Actions for Activate not able to be changed.",
        "Fixed Mouse Button assignment to hotkeys showing badly in the hints, such as on status indicators or slots. Now assignments can show as an image."
      ]
    },
    {
      "version": "0.1.1464.6952",
      "notes": [
        "Added support for all device button and key assignments to game controls. This will allow you to bind any buttons on your mouse to any of the controls. This includes gamepad buttons, however no axis support (yet).",
        "Added conflict checking to controls scheme, and a window poping up to advise players when a conflict exists. This warning will show in the main menu screen when a conflict exists. Any conflicts in the controls scheme will show in the conflict assignment window itself in red.",
        "Fixed invalid drag and drop results were still being actioned, allowing you to put things into slots you should not able to. Now results of drag and drop correctly enforced.",
        "Fixed items in hands not updating their status correctly. For example, opening a canister in your hands. Now objects in hands correctly update their status. (Credit: Carlen White via Discord).",
        "Fixed chatting or labelling was causing inventory actions (such as InventorySelect, F) to run. Now while chat typing or labelling, Inventory controls are disabled. Mouse control still enabled for typing but only with the mouse - not F key.",
        "Fixed closed inventory windows and slots can still be interacted with by pressing InventorySelect. Now when slot is hidden, cannot be interacted with.",
        "Fixed player status in the top right not updating while MouseControl activated. Most noticable while changing the pressure using the PressureUp interaction. Now this window runs independently and will continue to animate."
      ]
    },
    {
      "version": "0.1.1463.6944",
      "notes": [
        "Added first pass of new window based controls assignment. Now when you click a control assignment, it brings up a new window and prompts you to begin recording the new control. Second pass will include checking for duplicate assignments and prompting the player."
      ]
    },
    {
      "version": "0.1.1462.6941",
      "notes": [
        "Fixed null ref when clicking in world when using drag and drop from world but cursor hasn't cast to anything.",
        "Added tooltip information to furnace indicating furnace is not hot enough to melt provided item. Also provides information that activate button can be used to melt ice that is placed inside it."
      ]
    },
    {
      "version": "0.1.1461.6938",
      "notes": [
        "Fixed unable to move character as client.",
        "Fixed Suit Storage and Pipe Connectors were not mixing, they were just meeting some pressure requirements. Now they will fully mix their atmospheres."
      ]
    },
    {
      "version": "0.1.1460.6935",
      "notes": [
        "Fixed running in DX9 with Volumetric Light enabled causing errors and broken rendering. Now Volumetric Lighting (and Atmospheric Scattering) are automatically disabled when running in DX9, and cannot be turned on."
      ]
    },
    {
      "version": "0.1.1458.6931",
      "notes": [
        "Added first pass of mouse drag and drop from world. With mouse enabled (Left Alt), click and drag an object from the world to a slot. Currently Move, Insert, and Merge are supported. Swap is not supported yet."
      ]
    },
    {
      "version": "0.1.1455.6924",
      "notes": [
        "Added Atmospheric Scattering for Mars world. This adds atmospheric scattered fog to the world, that varies with the daytime. Must be enabled in Video options. Disabled by default until performance impact assessed. Known issue: makes the sun very large.",
        "Fixed able to interact with Sorter and Vending machine export slots."
      ]
    },
    {
      "version": "0.1.1454.6920",
      "notes": [
        "Fixed Furnace changes for ice causing ice in hidden slots (like mining belt) to continue to melt in sun. Now no longer allow this as it was before.",
        "Fixed Labeller setting directly on non-logic devices was not being applied for non-host clients. Now server correctly processes non-logic setting requests from a client using a Labeller.",
        "Added Stacker wheel can now be set to a value directly with the labeller."
      ]
    },
    {
      "version": "0.1.1453.6916",
      "notes": [
        "Fixed Gas Canisters not updating their values. Last time only fixed it for things with showing interactables (the suit) but not for the backpack.",
        "Added Drag and Drop insert functionality. Able to insert items directly into some items just by dragging over the item. For example, dragging steel sheets directly onto a backpack in the backpack slot will allow you to insert the steel sheets directly into it, without the need to open it up.",
        "Fixed jetpack not hovering properly when in gravity. Now counteracts gravity completely.",
        "Changed Construction Cursor to offset based on bounds of what is being created. This means small objects will be closer to the player and their grid selection will be more consistent.",
        "Added Road Flare will ignite Internal Atmosphere of its parent if in a slot, for example in a furnace."
      ]
    },
    {
      "version": "0.1.1452.6911",
      "notes": [
        "Fixed furnace producing infinite amounts of gas. Now the ore will only be smelted into its reagents if the furnace is above its flashpoint temperature. There are still some gas exploits remaining that will be fixed later. Note: this will alter how you create ores with a brand new furnace. The ice will eventually cool down the inside of the furnace, so you will need to heat the furnace up with their the sun or another gas or an igniter to get it started.",
        "Fixed Ground Penetrating Radar was missing it's blueprint.",
        "Added Reagent Reader. This logic unit is able to read the current recipe, reagent contents, and required reagents for any manufacturing device and report the quantity for that reagent. Buildable off the Logic I/O kit."
      ]
    },
    {
      "version": "0.1.1450.6905",
      "notes": [
        "Fixed interactions sometimes get disabled and are not able to reinitialize until removed. Now get correctly set and reinitialized.",
        "Fixed RAND function on Math Unary always returning the same random number for all logic units. Now each logic unit will generate its own randomized seed for each random function."
      ]
    },
    {
      "version": "0.1.1449.6902",
      "notes": [
        "Added RAND and SQRT to LogicMathUnary. RAND returns a random (double precision) number between 0 and whatever you input, even tick. SQRT returns the square root of the provided input."
      ]
    },
    {
      "version": "0.1.1448.6899",
      "notes": [
        "Fixed progression problems with tutorial. Now prompts more for what to hold when welding. Drag task now correctly updates for canister. Prompt to clear hands after cooking task, instead of tablet which is likely already dropped."
      ]
    },
    {
      "version": "0.1.1447.6897",
      "notes": [
        "Fixed error when loading a mod that contained changes to mineral spawn rates.",
        "Fixed gas canister inventory text pressure values not updating in player inventory on loading an old world. Now correctly update every frame, even if loaded in before the player.",
        "Fixed invalid drag and drop icon missing from animation.",
        "Fixed null reference breaking game when exiting tutorial prematurely. Now gracefully resets when player exits Tutorial.",
        "Fixed progression bugs when repeating tutorial without restarting game. Now resets progressing each time you start the tutorial.",
        "Fixed issue where you wouldn't be able to consume the muffin to complete a tutorial step if your hunger rate was set to 0.",
        "Fixed error on load if the currently selected recipe on a crafting machine is for an object that does not have a blueprint wireframe created.",
        "Fixed missing blueprint for DynamicGPR"
      ]
    },
    {
      "version": "0.1.1444.6887",
      "notes": [
        "Fixed nulreference exception with Bioprinter. Credit: GamersCircle."
      ]
    },
    {
      "version": "0.1.1443.6885",
      "notes": [
        "Added new mouse inventory control icons."
      ]
    },
    {
      "version": "0.1.1441.6878",
      "notes": [
        "Fixed incorrect glass material on new Vending Machine model.",
        "Added new tutorial."
      ]
    },
    {
      "version": "0.1.1439.6870",
      "notes": [
        "Added proper Vending Machine model as a replacement for existing placeholder.",
        "Fixed Issue where inventory window titles would calculate bounds incorrectly and block ability to click on inventory slots directly above or below them."
      ]
    },
    {
      "version": "0.1.1438.6867",
      "notes": [
        "Fixed Pipe Analyzer now paintable in kit/item form and will properly perserve its colour when deconstructed.",
        "Fixed Interaction UI buttons not getting cleared out between games, causing errors if you left a game with some visible and started a new one. (Credit: Eearslya)"
      ]
    },
    {
      "version": "0.1.1437.6862",
      "notes": [
        "Fixed Wall Arch variant was not set to 'Block Gravity', so a room completed with them would not properly have gravity applied as per other wall types and frames.",
        "Fixed 'Large Panel' wall variant not blocking air or sunlight. Masoneer Bug List #0121 (Credit: JawnyCat)",
        "Fixed player climb infinitely after ladder removed. (Masoneer Bug#0152 - Credit Austin5003)",
        "Fixed Sorter white-list drop down box was sometimes appear empty if they had been cleaned up prematurely. (Credit: Risu)",
        "Fixed Slot type on CartridgeGuide so it can now be placed correctly into a tablet.",
        "Fixed sleepers kicking humans out when loading a save.",
        "Fixed error with initializing object pools before mining manager was initialized. Was throwing an error on starting game."
      ]
    },
    {
      "version": "0.1.1436.6852",
      "notes": [
        "Fixed Players can no longer mouse-drag a Dynamic Item being held by the handle into their free hand and carry it.",
        "Fixed abnormal rotation behaviour.",
        "Changed ores to use an object pool (Bonus, now ores maintain their rotation between saves!)",
        "Refactored some parts of chunks/\"crystals\" as I touched them"
      ]
    },
    {
      "version": "0.1.1435.6847",
      "notes": [
        "Fixed Batch Reader not sending Type change to server, and not changing. Credit: Draz.",
        "Fixed thing names not showing up correctly on eReader Cartridges for Chinese, Japanese and Korean.",
        "Refactored Asteroid and ChunkObject. Just removing some useless/unused code in preparations for larger changes."
      ]
    },
    {
      "version": "0.1.1434.6840",
      "notes": [
        "Added TerrainGeneration class and moved a lot of code from WorldManager to TerrainGeneration",
        "Changed some heavily used parts of Chunk Object to use Grid3 instead of Vector3 to gain some performance.",
        "Changed default keybind for QuantityModifier to C from RightAlt based on community feedback. Note: this will not affect existing bindings, so you will have to manually change it yourself. It will only affect new installs or those who reset their controls.",
        "Added ImportCount and ExportCount settings to all devices that Import/Export. These counters increase whenever something is imported or exported. You can clear the value by writing anything greater than one to the ClearMemory flag on the device. This makes keeping count far easier. If you insert a stack of 50 iron ore into the stacker while it has a stack size output set to one, ImportCount will increase by one but once the stack is finished exporting, the ExportCount will have increased by 50.",
        "Fixed Error when changing Anti-Aliasing setting via the main menu after leaving a game (Thanks virusek20).",
        "Fixed mouse drag cursor UI scale not being correctly set on load, and only when scaled. Now initialized on window setup.",
        "Fixed Circuitboard (Hash Display) was not craftable. Now added to Electronics Printer and Fabricator.",
        "Fixed hash errors with displaying the hash for an object in a localized tooltip. Credit: Risu via discord for the new Regex line.",
        "Added all logic processors (compare, math, etc...) now expose setting attribute to logic network for read only access. This reduces the need for additional logic writer + memory to read the results. Credit: Otti via Discord."
      ]
    },
    {
      "version": "0.1.1433.6828",
      "notes": [
        "Fixed Batch Reader displaying wrong type. Credit: Risu via discord."
      ]
    },
    {
      "version": "0.1.1432.6826",
      "notes": [
        "Increased Pressure Regulator max setting from 100 atm to 200 atm.",
        "Fixed junk collider left in scene that caused collision issue on new map."
      ]
    },
    {
      "version": "0.1.1431.6824",
      "notes": [
        "Added Hide All Windows key, defaults to Tilde (BackQuote).",
        "Fixed numerous inventory bugs, such as null references related to dropping items into interaction buttons."
      ]
    },
    {
      "version": "0.1.1428.6818",
      "notes": [
        "Fixed various bugs with new Inventory system. Many state issues fixed, such as active hand opening and closing. Also fixed the construction cursor."
      ]
    },
    {
      "version": "0.1.1426.6815",
      "notes": [
        "Refactored Inventory control for keyboard and mouse. Now features docked windows, use keys to open and close or click with mouse to change. Allows multiple windows to be open, scrolling between all open slots and interactions. Mouse now allows movement between slots within players inventory. Better support for language and keyboard changes, and reduce memory and garbage collection significantly by pooling windows and slots. Unified event-based slot management means that keyboard and mouse control results (should) be unified and (should) reduce the maintenance cost of running dual systems."
      ]
    },
    {
      "version": "0.1.1425.6813",
      "notes": [
        "Fixed could place Sleeper, Solid Fuel Generator, and Locker without a frame below. Now requires a frame below it.",
        "Fixed glitches when dragging a primary slot item in mouse inventory control. Now only shows orange when opened, not when attempting to drag.",
        "Added temporary icons to let player know what they are doing when they drag with mouse inventory control.",
        "Fixed plants growing in hydroponics trays and stations disappearing too early on clients.",
        "Fixed objects were not being scaled correctly when put into slots. Now correctly scale objects that are placed in slots so that they fit if the slot is smaller than they are.",
        "Added caching of interactable and slot bounds. Previously, the game was generating them for every object on the objects creation. This could cause delays and problems when loading assets. Now this is cached when the asset is made or changed so running games do not need to generate them."
      ]
    },
    {
      "version": "0.1.1423.6800",
      "notes": [
        "Added drop ability on Inventory Mouse control.",
        "Added second pass of Mouse Inventory control. You can not drag and drop to move or swap items in your inventory. You can also use the interactions for master slots.",
        "Fixed Slot Reader was not serializing the selected slot. Now correctly saves and loads the slot index."
      ]
    },
    {
      "version": "0.1.1422.6793",
      "notes": [
        "Added Chute Inlet lock state controls input. If you want to stop a chute inlet from stopping collecting, set its lock state to one. Setting to lock zero resumes it. Credit: Drazuam from twitch for idea.",
        "Added more input mouse functionality. Key inventory state remembers what you had selected with the mouse.",
        "Fixed Could power on/off items in hands that should not have been custom interactable."
      ]
    },
    {
      "version": "0.1.1421.6791",
      "notes": [
        "Added Light state status icon. This will show if you are wearing a helmet with a light. It will show the current light state, and the key required to change it. This helps prompt players for the hotkey to turn their lights on and off.",
        "Added Active Hand Power state status icon. This will show if you have something in your hands with a On/Off state. This helps new players learn the hotkey to quickly toggle something on and off - such as a tablet or a mining drill.",
        "Fixed bug with windows being closed when pressing left or right mouse button.",
        "Fixed some missing localization strings for Logic Systems (much more to follow)."
      ]
    },
    {
      "version": "0.1.1420.6788",
      "notes": [
        "Fixed Prevented already dead players not being removed and spawning a skeleton every half second.",
        "Added Logic Batch Reader. This functions much the same as the Batch Writer. You select a device \"type\" on the network, the variable you want to read, and then the method you want to read them via (Sum, Average, Minimum, Maximum). You could use this to read the Sum of the power output from solars, for example, or find the maximum stack setting across a bunch of stackers. You could combine it with a bunch of slot readers, to reach the total amount of quantity on a bunch of slots. Constructable on the I/O logic kit.",
        "Fixed visibility of solar panel. It was always displaying a minimum of 17%",
        "Changed the tooltip on the solar panel from displaying visibility to displaying the more useful and relevant efficiency",
        "fixed portable GPR throwing a null when it reads a bedrock voxel",
        "Fixed occasional bug with Radiator or Pipe Label placement onto a pipe whose rotation includes small floating point precision errors. (Credit: Eearslya, Risu)",
        "Fixed unlimited door label text. There's now a 32 character limit on the displayed text on a composite door and each world will be split if longer than 8 characters.",
        "Updated Language files for German and Spanish (Credit: Bonbon_kocher & socramazibi)",
        "Fixed inconsistent egg shell stacking behaviour. (Credit: jpdoulos on the Steam Bug Board)"
      ]
    },
    {
      "version": "0.1.1415.6773",
      "notes": [
        "Fixed alt-tabbing caused issues with the draft mouse inventory control system.",
        "Added crowbar tooltip message for Area Power Control.",
        "Added automatic replacement of LEFT ALT to the new bind RIGHT ALT, as LEFT ALT is now used for mouse inventory control. If you want to do small changes, you now by default will use RIGHT ALT.",
        "Fixed null reference when reverse going through Logic Slot Reader."
      ]
    },
    {
      "version": "0.1.1414.6769",
      "notes": [
        "Fixed missing material from vending machine causing alpha tearing on texture.",
        "Removed logic functionality for import and export on devices. This has been depreciated for the Slot Reader. Note: This will break anything relying on Import or Export variables in the logic system - you will need to replace the Logic Reader with a Logic Slot Reader and configure it.",
        "Added Slot Reader. This allows you to configure to read a particular slot in a device. Different slot types will give different options. For example, stacks would allow you to read stack quantity, hash type, damage state, and more. Gas Canister slots allow the reading of Pressure and Temperature, directly. This provides much more power than the previous system. Note: This change will cause Logic Readers that used the old Import/Export variables to be broken, as well as hydroponics stations."
      ]
    },
    {
      "version": "0.1.1413.6767",
      "notes": [
        "Added Vending Machine. This structure holds up to 100 items, and can be connected to both import and export to chutes. To dispense items can be selected via buttons, with the currently selected item displayed on a screen. However, you can also request items by setting a Hash reference to the item type. The vending machine will then dispense the first stack it can find that matches that hash, and export it. This allows you to make fully automated factories much easier, as you have a smart storage system.",
        "Fixed missing blueprints for many items.",
        "Added first pass of Mouse Inventory control. Hold LEFT ALT to bring up mouse cursor.",
        "Fixed some furnace strings not localized.",
        "Added 3d printer effect to simple fabricators."
      ]
    },
    {
      "version": "0.1.1412.6764",
      "notes": [
        "Changed Ingot stacks spawned by the debug menu will now contain the maximum quantity.",
        "Added Kit (Portable Generator) can be made on Electronics Printer.",
        "Fixed Inability to force feed heal/stun pills or split stacks of them.  Also added blueprints for precision placement mode.  Masoneer #0001.",
        "Fixed skeletons reappearing on load. You should no longer see spooky skeletons that have disappeared pop up again when loading a save."
      ]
    },
    {
      "version": "0.1.1411.6759",
      "notes": [
        "Removed writing Flag variable to motherboard as there were multiplayer issues. Can still read. Will be reviewed in future.",
        "Removed old spawnable crates.",
        "Fixed screen effects not showing in third person. Now volumetric lighting now correctly shows on local character when in third person."
      ]
    },
    {
      "version": "0.1.1408.6753",
      "notes": [
        "Fixed Smart Canister notification light offset locations."
      ]
    },
    {
      "version": "0.1.1407.6746",
      "notes": [
        "Fixed unable to interact with slots on securing crate to crate mount if the lid was open when crate was mounted. Now can correctly interact.",
        "Fixed various pipe kits not correctly paintable and displaying the correct colors.",
        "Fixed Pipe Valve not paintable and does not show correct color thumbnails. Now correctly paintable and shows correct thumbnails for color in inventory.",
        "Changed strings with \"Construction Kit\" to \"Kit\" for names.",
        "Added Kits for constructing Portable Air Conditioner and Portable Scrubber. These are produced from the Pipe Bender. Use right click action to build these in front of you.",
        "Fixed Helmet light being operable when not on head slot"
      ]
    },
    {
      "version": "0.1.1404.6737",
      "notes": [
        "Fixed Missing sounds on some assets after addition of access control.",
        "Fixed Steel Frame (Side), (Corner), and (Corner Cut), can be placed repeatedly over top of one another, or overlapping other objects. Masoneer #0053.",
        "Fixed the furnace contents window will never show more than 500, but will still correctly output what youve put into it. Ie. 2000g of steel would be four 500g bars, but the windows will just say \"500\". Masoneer living bug list 0096. Now reports how many stacks will be produced, and the remainer, of the current contents."
      ]
    },
    {
      "version": "0.1.1403.6732",
      "notes": [
        "Fixed Errors when writing a hash value directly to a HashDisplay circuitboard using logic rather than setting the source via data disk.",
        "Fixed ItemPipeRadiator now paintable.",
        "Fixed Smart Canisters now have the correct maximum pressure (~20MPa).",
        "Fixed Smart Canisters destroyed model now has the correct pivot location.",
        "Fixed wilted plants being destroyed from damage",
        "Fixed bug which would allow someone to spawn multiple pipes on top of a radiator",
        "Fixed a bug where if a radiator was placed first a pipe of any orientation could be placed",
        "Fixed Missing sounds on some structures after the addition of the access control interactions.",
        "Fixed incorrect fabricator placement restriction"
      ]
    },
    {
      "version": "0.1.1401.6722",
      "notes": [
        "Fixed Labeller breaking after labelling 10 items. Credit: Eearslya."
      ]
    },
    {
      "version": "0.1.1400.6720",
      "notes": [
        "Fixed null reference when adding/removing graph display from console.",
        "Fixed Input Window would not apply changes when using the \"Chat\" key (Return). Now correctly submits the value instead of cancelling the value.",
        "Added custom model for Kit (Hydroponics Station)",
        "Fixed able to place Hydroponics Station floating in the air. Now requires a frame below it."
      ]
    },
    {
      "version": "0.1.1398.6710",
      "notes": [
        "Added Access control to Battery, centrifuge, Generator, Pump, Recycler, Suit Storage, Transformer, and Flashing Light.",
        "Added Circuitboard (Graph Display). Can be built on the Electronics Printer. Takes the average setting from any assignable device and records the value. Records a value every tick (half second) and then renders them as a graph. Color of the line is take from the Console color.",
        "Added key bind for turning headlamp on and off. Default: 'L'",
        "Added MotherShip Core Kit for constructing it",
        "Changed MotherShip initial block back a frame",
        "Fixed dedicated server InputWindow error when launching by moving the InputWindow.Initialize to not run on the dedicated server",
        "Fixed errors with effects manager trying to render effects on the dedicated server"
      ]
    },
    {
      "version": "0.1.1397.6703",
      "notes": [
        "Fixed structures without broken build states not deconstructing. Re enabled reverted changes."
      ]
    },
    {
      "version": "0.1.1396.6701",
      "notes": [
        "Added Kit (Crate) Item. When used with secondary action (Right Mouse) creates a Dynamic Crate. These can be built on the Autolathe using Iron Ingots. This allows early game creation of Dynamic Crates for use storing things. Credit: Nysch on Steam Suggestion forum."
      ]
    },
    {
      "version": "0.1.1395.6698",
      "notes": [
        "Fixed plants being deleted when being harvested. This was an erroneous fix to previous bug with plants when destroying their growing tray. Now plants will be destroyed when destroying their tray, but only if the seed has grown. If the seed is mature, it will be harvested normally instead of being destroyed. If the seed is still a seed, it will be ejected like all other inventory would.",
        "Fixed Missing Action string values for Cycle, Force Open and Force Close."
      ]
    },
    {
      "version": "0.1.1391.6693",
      "notes": [
        "Refactored player input window. Performance improved and code simplified. Also stores previously entered values. You can select the previous ones using the mouse wheel while in the input screen. A maximum of ten previous entries are stored. The input window will also display the input mode (such as alphanumeric, or decimal number, or integer only).",
        "Fixed bug with Hydroponics Station not registering daylight. When the device is turned off, it should check to see if it is in sunshine."
      ]
    },
    {
      "version": "0.1.1389.6688",
      "notes": [
        "Added able to set values with keyboard input using a labeller on a button on the Transformers, Pipe Regulators, Volume Pump, and Mixer. This is similar to setting a value using the labeller on memory. This is a much faster (and more specific) way of setting a value on the device than clicking the wheel to move it.",
        "Fixed door and airlock action strings not localized.",
        "Fixed Hydroponics Station not receiving water. Volume was set to zero, so no mixing with connected pipe network would occur."
      ]
    },
    {
      "version": "0.1.1388.6684",
      "notes": [
        "Added Diode Slide. This is a diode that slides between 0 and 1 based on what its setting is, and shows a balance of red or green based on the value of this. Useful for reporting how full something is using the logic system.",
        "Added Smart Gas Canisters.  Twice the capacity of the default gas canisters, and featuring a display roughly depicting its pressure level."
      ]
    },
    {
      "version": "0.1.1387.6680",
      "notes": [
        "Added Hydroponics Station. This is an advanced hydroponics grower. It has four slots and provides UV light for the plants to grow, even when in darkness. This UV light is toggleable on and off as it draws a lot of power. It also provides data on it's four slots, providing Growth state, efficiency, health, and the Hash of what kind of plant is inserted. Water should be provided via the pipe, everything else is gathered from the atmosphere around the station. Internal atmosphere (water) is exposed via the logic system also.",
        "Added kit (Hydroponics Station). Producable off the Electronics printer. Allows construction of the Hydroponics Station for advanced growing.",
        "Fixed Pointing a Tablet with an Atmospherics Analyzer cartridge at a Tank Storage will now display the internal atmosphere of the contained gas canister (if present).",
        "Added new custom model for Security Printer. Also features dedicated button for Select Recipe functionality.",
        "Can now place place a pipe and a cable in the same grid (but not more than one of the same type) as long as the ends don't overlap.",
        "Fixed ability to place crafting machines without a frame underneath.",
        "Added Circuitboard (Hash Display). This circuitboard can be connected with anything that has a readable hash. The prime example is linking it with any fabricator, and the display will show a thumbnail of what is selected as the current recipe. It could be set to read a Logic unit such as a Reader, which is in turn set to read from the Arc Furnace Export Slot Hash, which would render a picture of the current Ingot type being produced.",
        "Added Flashpoint, Autoignition, and Hash, to the EReader (Credit: Masoneer)."
      ]
    },
    {
      "version": "0.1.1383.6665",
      "notes": [
        "Fixed atmos thread crashing when a wall takes damage from overpressure. Overpressured bases should no longer give a huge wall of errors.",
        "Changed input window to lock to input type (i.e. numbers).",
        "Added Logic Memory values can be directly set via keyboard entry. Use a labeller on a screw to bring up the value input screen and enter a value. This will then be set to the memory unit.",
        "Fixed logic mirror showing error when it should not. Now checks its state after assignment. (Credit: Masoneer).",
        "Removed ability for Logic Mirrors to reference other logic mirrors, as it was too easy to make infinite loops referencing each other.",
        "Fixed potential bug where two logic mirrors could reference each other, therefore locking up the power thread. Now logic mirrors can only reference other logic mirrors so long as they don't already reference it. Note: Logic mirrors will be \"invisible\" on the logic system until they have been assigned to mirror a device.",
        "Changed Elevator Shaft and Levels deconstruction from Drill to Angle Grinder. Now you must use the Angle Grinder to deconstruct them, and it takes slightly longer.",
        "Fixed unable to open and close crate that is mounted. Now can open and close a mounted crate.",
        "Fixed Z-fighting between composite floor tiles and Elevator Levels."
      ]
    },
    {
      "version": "0.1.1382.6655",
      "notes": [
        "Changed Kit (Elevator) model to a new custom model, which also allows painting the kit itself so the produced structure comes out correctly painted.",
        "Added Logic Mirror. Has a screw that allows the selection of any device on it's input network. All variables of that device are then mirrored on this device, allowing you to mirror the logic state of devices between different networks. You are able to both read and write to the mirrored device. If the logic mirror is not powered, it will return no data and will not allow setting data. The logic mirror itself will be completely hidden to the logic system, as it's purpose is only to mirror. It is buildable off the Logic I/O Kit.",
        "Fixed newly placed and unset LED displays not turning their display off when power toggled (credit: Eearslya). Now LED displays will correctly turn their display off when lost power or switched off.",
        "Fixed able to construct printers and fabricators in mid air. Now requires mountable frame below to Build.",
        "Added Container Mount. This functions like a Tank Connector, you can drag a container onto the mount and then use your wrench to secure or unsecure it."
      ]
    },
    {
      "version": "0.1.1381.6648",
      "notes": [
        "Fixed issue with some values being clamped to invalid ranges.  Caused some crafting machines to return incorrect resource values and some logic configurations to behave oddly (among other things)."
      ]
    },
    {
      "version": "0.1.1379.6645",
      "notes": [
        "Fixed commander slot access card slots were not correctly merging access permissions (credit: Masoneer / Risu). Now each slot access permissions correctly merged."
      ]
    },
    {
      "version": "0.1.1378.6643",
      "notes": [
        "Fixed ElevatorCarrage was set as spawnable, so people were spawning it in creative. The ElevatorCarrage is a unique item, that should only be spawned by the shafts itself. Now not spawnable manually.",
        "Fixed null reference exception on new shaft creation. Carrage was incorrectly trying to initialize before being correctly assigned to the shaft network. Now gracefully handles this.",
        "Added Logic Motherboard support of Quantity, Export/Import slot details, and Recipe Hash."
      ]
    },
    {
      "version": "0.1.1377.6640",
      "notes": [
        "Fixed Import and Export Slot Quantity was not reporting quantity for consumables (such as ingots). It was only supporting quantity checking for stackables. Now correctly reports quantity for stackable and consumable.",
        "Added Chute Bin logic support for slot. Now will report slot occupied (0 or 1), slot occupant type (hash), and slot quantity (stackable or consumable quantity).",
        "Changed Product Code read/write on fabricators to RecipeHash.",
        "Added logic reading of contents of Import and Export slots. Now can read the contents using ImportSlotHash and ExportSlotHash. Each type of item has a unique hash. A gold ingot in a slot would give a hash of 226410516. This means you can check if the contents of an export or import slot is of a certain type, and then implement logic accordingly.",
        "Fixed insidious bug with Approximately implementation that resulted in large numbers in logic system not being correctly managed.",
        "Changed Logic system to use \"double\" precision as a base, rather than \"float\", due to precision issues. Devices still tend to use floats for implementation. Some devices will be moved to double (such as energy) due to precision issues. These issues remain and will be fixed when this is changed.",
        "Added Logic reading and writing of current product code to basic fabricators (printers). You can now read the \"product code\" which will give you an integer that is a reference to that product. You can store this value easily in memory using a Logic Reader. When you subsequently \"write\" that value back, as a Product code again, it will set that printer to that recipe. This allow you to automatically control what a printer is producing, and potentially make automated factories."
      ]
    },
    {
      "version": "0.1.1376.6636",
      "notes": [
        "Added logic hooks for Elevators. Any elevator (both shafts and levels) will return the ElevatorLevel being the current level of the carrage on the local elevator network. You can also set the ElevatorLevel, which will make the carrage try to go to that level. And you can read the ElevatorSpeed, which is how fast the elevator is going. Where the carrage is missing, error values will be returned (like -1 for the ElevatorLevel).",
        "Reverted Destroyed Build States and Thermodynamics changes as they were causing issues."
      ]
    },
    {
      "version": "0.1.1375.6633",
      "notes": [
        "Added first pass of Elevator support. Build Kit (Elevator) on the Electronics Printer. Two current placable blocks: Elevator shafts and Levels. When a level is placed, an elevator carrage will be created. You can only merge elevator networks where only one of them contains a carrage. The levels require power to operate their doors. Note: this is only the first pass and they may substantially change! Be very careful with this while they are on the beta branch in your saves. KNOWN ISSUE: They will not work as expected on motherships. Next update will ensure they work correctly on motherships.",
        "Added more broken build states to frames. Structures will now break to a corresponding build state if there is one, otherwise they will break to the next available build state down",
        "Fixed broken structures being able to be deconstructed instantly by any object",
        "Allow both radiative and convective heat transfer at the same time on Things (e.g. radiators). Radiators should no longer be less effective if placed in an atmosphere.",
        "Added broken build state to steel frame",
        "Fixed missing gun hit particle",
        "Added give up option when going unconscious. You can now kill yourself on becoming unconscious and respawn immediately, instead of waiting for death."
      ]
    },
    {
      "version": "0.1.1373.6615",
      "notes": [
        "Fixed missing gun hit particle",
        "Fixed an error being caused by the deconstruction particle effect trying to run on non structure things",
        "Fixed bug with animation on Electrolyzer.",
        "Updated Electrolyzer power usage from 180 to 1200.",
        "Added deconstructing of broken structures. They deconstruct to their wreckage parts using either the welding tool or the grinder.",
        "Fixed missing destruction particle prefab in scene",
        "Fixed with SMG does not exit aim mode when hand is changed"
      ]
    },
    {
      "version": "0.1.1372.6603",
      "notes": [
        "Added particle effect when a structure is deconstructed(when the buildstate is reduced or when it is destroyed via damage)",
        "Updated blueprint for Electrolyzer.",
        "Changed Electrolyzer power usage to 1200W.",
        "Changed Electrolyzer return ratios to 1:1 Volatiles and 1:0.5 Oxygen.",
        "Fixed bug with Electrolyzer power button animating twice.",
        "Fixed error when Electrolyzer input pipe was empty."
      ]
    },
    {
      "version": "0.1.1371.6597",
      "notes": [
        "Added Electrolyzer.  Available on the Atmospherics kit, it consumes a lot of power (and therefore generates quite a bit of heat) to convert moles of water into hydrogen and oxygen."
      ]
    },
    {
      "version": "0.1.1370.6593",
      "notes": [
        "Add Build state of structures now decreases with damage",
        "Add broken build state for anchor and composite walls."
      ]
    },
    {
      "version": "0.1.1369.6585",
      "notes": [
        "Fixed Fuel Generator gauge display orange on one side.",
        "Added first pass of damaged buildstates for structures. Engine can now be dealt damage until it is wrecked into a damaged build state and then more until it is destroyed and drops wreckage pieces.",
        "Fixed bug with fertilized eggs causing an error when hatching because the shell fragment assets could not be loaded.",
        "Wall Coolers now properly stackable to a max of 5.",
        "Fixed broken split interaction labels on Wall Cooler and Wall Heater."
      ]
    },
    {
      "version": "0.1.1366.6562",
      "notes": [
        "Added a recoil to guns",
        "Added decay timers to all Entities, including chicks and grounders."
      ]
    },
    {
      "version": "0.1.1365.6557",
      "notes": [
        "Added ladder recipe to fabricator"
      ]
    },
    {
      "version": "0.1.1362.6552",
      "notes": [
        "Fixed ability to control access on Dynamic Air Conditioner was missing.",
        "Fixed Missing sounds on structures that had access controls added to them previously."
      ]
    },
    {
      "version": "0.1.1361.6546",
      "notes": [
        "Updated language file for SMG",
        "Added recipe for SMG and SMG Mag",
        "Fixed slot types and names on guns",
        "Fixed SMG prefab name string",
        "Fixed wall cooler causing infinite loop when turned on. Wall coolers now require a valid atmosphere in the pipes again.",
        "Updated SMG model to have reflex sight",
        "Updated SMG model to the correct",
        "Fixed serialization of Ammo Box",
        "Fixed fire cooldown time to use main thread to prevent slowdown of firing when threads are busy",
        "Added a new animation with ladder."
      ]
    },
    {
      "version": "0.1.1359.6535",
      "notes": [
        "Added SMG and SMG mags",
        "Added mag types. These will be updated as it's hard to tell the difference right now. Both are reloaded from the same ammo box currently."
      ]
    },
    {
      "version": "0.1.1358.6532",
      "notes": [
        "Fixed serialization on gun mags",
        "Fixed bug that caused the gun to still have a reference to a removed magazine",
        "Fixed wall coolers destroying atmospheric energy if connected pipe has no atmospheres. Now Wall Heaters will not work if the output pipe has no atmosphere in it. (Sorry, Juice!)"
      ]
    },
    {
      "version": "0.1.1357.6528",
      "notes": [
        "Fixed interaction on ammo box",
        "Added recipes for gun, mag, and ammo box",
        "Updated Japanese, German and Spanish translations.",
        "First pass on fire arm weapons. Available is now the Pistol, Pistol Magazine, and Ammo box for reloading Magazines."
      ]
    },
    {
      "version": "0.1.1354.6514",
      "notes": [
        "Fixed incorrect respawn position when player died in Sleeper."
      ]
    },
    {
      "version": "0.1.1353.6509",
      "notes": [
        "Fixed blueprint missing for precision place for Battery Charger kit, Authoring tool, and Nuclear Battery.",
        "Fixed Access cards stored in the second access card slot on an officers uniform now correctly grants access."
      ]
    },
    {
      "version": "0.1.1351.6497",
      "notes": [
        "Fixed bug with Roller cover not colliding with self or other doors. Now correctly collides with other doors and other roller doors.",
        "Fixed bug with roller cover collision for the handle not animating and not being in the correct positions. Now the handle is always the location of the collider for opening and closing it. Also fixed the small delay when opening and closing, now animation starts immediately.",
        "Fixed some situations with inventory swapping between internal slots being allowed when it should not be, and interactions sometimes being allowed via the menu when they should not be. Now a faux interaction is generated when making the UI and solves the problem.",
        "Added first pass of access control. Access Cards can be made in the (new) Security printer, which are preset with access according to their color. You can also make a new Cartridge for Access Control assignment (on the Security printer also). Currently access control can only be assigned to Doors, crates, and lockers but there is nothing stopping it being extended to pretty much everything we want in the game. This will be expanded on later, and exposed to the logic system. Access is controled/stored as bitflags so bit operators may be needed in future for the logic system.",
        "Added Access cards (see access control above). To use, have them in your hands or in a access card slot. They all are considered together, so holding Red and Blue Access cards in your hands will give you access to both systems.",
        "Added Security Printer for printing Access Control equipment and weapons.",
        "Fixed missing blueprint meshes for Composite Cladding.",
        "Added Access Card slots to Jumpsuit (One card) and Commander (Two cards).",
        "Fixed collider placement on StructureRocketEngineDestroyed to better align with the mesh.",
        "Added a input filed for search a file to the load world panel."
      ]
    },
    {
      "version": "0.1.1348.6486",
      "notes": [
        "Fixed / Re-fixed authoring Tool for Constructor things."
      ]
    },
    {
      "version": "0.1.1347.6484",
      "notes": [
        "Fixed issue with construction kits not consuming while building"
      ]
    },
    {
      "version": "0.1.1346.6482",
      "notes": [
        "Fixed Authoring Tool for Constructor things in multiplayer."
      ]
    },
    {
      "version": "0.1.1345.6480",
      "notes": [
        "Fixed location of 'Defaults' button on graphics settings page."
      ]
    },
    {
      "version": "0.1.1343.6477",
      "notes": [
        "Fixed missing part of authoring tool mesh",
        "Fixed material on authoring tool"
      ]
    },
    {
      "version": "0.1.1341.6473",
      "notes": [
        "Added thumbnail for Authoring Tool."
      ]
    },
    {
      "version": "0.1.1340.6467",
      "notes": [
        "Fixed Face structures that are restricted to Y rotation from being placed on the wrong face after placing a face mount structure that is not restricted to Y rotation",
        "Fixed Dynamic Tanks not being able to be wrenched onto a Tank Connector on a Mothership.",
        "Fixed Authoring mode persisting for items that were used with the authoring tool after the authoring tool has been dropped",
        "Fixed not exiting build mode when removing authoring tool from hand"
      ]
    },
    {
      "version": "0.1.1339.6460",
      "notes": [
        "Fixed helmets held in hand affecting player's suit's atmospheres. Dropping a helmet in your hand while having another helmet on should no longer flush your internal atmosphere. Thanks Meow~ster!"
      ]
    },
    {
      "version": "0.1.1338.6458",
      "notes": [
        "Added wreckage construction tool to help with authoring event maps.",
        "Added DestroyedStructure base class and destroyed variant of Rocket Engine.  These can be harvested using either a welding torch or grinder into wreckage chunks, that can be stacked and fed into a Recycler."
      ]
    },
    {
      "version": "0.1.1337.6456",
      "notes": [
        "Fixed issue with SolarPanel's jitter and horizontal direction was initialized when world is loaded."
      ]
    },
    {
      "version": "0.1.1336.6452",
      "notes": [
        "Updated Authoring Tool model"
      ]
    },
    {
      "version": "0.1.1331.6440",
      "notes": [
        "Added [EXPERIMENTAL] False State to Logic Motherboard States.  This allows you to configure a state in which the logic motherboard will transition to if conditions of the current state are not met, without triggering associated actions.  To keep the existing behaviour on a given state, its false state should be set to itself.  This will be the default for any states in saves created before this change was introduced.",
        "Fixed Inability to use logic motherboards to work with the 'Setting' logic value on stackers.",
        "Fixed motherships disappearing when moving away from starting point.",
        "Changed player behaviour on Conveyors to fix a bug. Previously conveyors were disabled to hide the bugs.",
        "Fixed incorrect orientation of Corner Conveyor switches."
      ]
    },
    {
      "version": "0.1.1328.6427",
      "notes": [
        "Fixed doors being placable on the wrong faces after using another face placement structure to change the rotation to an up or down face",
        "Fixed part of the construction cursor being left in world if it was enabled when disconnecting",
        "Changed mothership atmosphers to dump back to the main atmosphere controller if they are not in a Room",
        "Changed occlusion manager to only set dynamic things gridcontroller to a mothership if they are inside a room"
      ]
    },
    {
      "version": "0.1.1327.6423",
      "notes": [
        "Fixed Issue with the sun not working on Dedicated Servers due to missing value."
      ]
    },
    {
      "version": "0.1.1323.6416",
      "notes": [
        "Added synchronization of SunOrbitPeriod on join. Servers should now be able to set custom day length when creating/loading a world."
      ]
    },
    {
      "version": "0.1.1322.6413",
      "notes": [
        "Fixed issue with canister pressure gauge needles rotating in the wrong direction."
      ]
    },
    {
      "version": "0.1.1321.6411",
      "notes": [
        "Fixed misaligned 3-way corner pipe connections as a result of previous update adding new pipe variant."
      ]
    },
    {
      "version": "0.1.1320.6409",
      "notes": [
        "Fixed fabricator printing effect on clients",
        "Added missing 4-way corner pipe variant and ruptured version.",
        "Added linked dock serialization"
      ]
    },
    {
      "version": "0.1.1318.6403",
      "notes": [
        "Fixed bug where recycler was only searching 1 layer deep for contents when calculating value of returned reagent mix.",
        "Fixed atmosphere bug that was causing atmospheres to not mix vertically.",
        "Refactored dock atmos mixing code"
      ]
    },
    {
      "version": "0.1.1316.6398",
      "notes": [
        "Fixed NRE when trying to recycle a reagent mix.  Can now recycle reagent mixes, ores and ingots but the resulting slag will need to be fed through a centrifuge until it's back in the form of usable ores.",
        "Fixed Stacker will now automatically eject whatever it is processing if an incompatible item is is in the input slot, allowing players to implement their own chute jam handling and resolution system.",
        "Added functionality to the Stacker.  Can now read the contents with logic, and read/write the quantity setting with logic.  It can also be used to automatically remove items from slots in a chute network, for example it can process a mining belt full of ores.",
        "Fixed bug with atmos not flowing between different grids properly.",
        "Fixed issue where loading settings from an old version could cause unrecoverable errors that required users to delete their settings file."
      ]
    },
    {
      "version": "0.1.1315.6392",
      "notes": [
        "Fixed issues with changing the sun orbit parameters when not in-game."
      ]
    },
    {
      "version": "0.1.1312.6387",
      "notes": [
        "Added settings screen option for SunOrbitPeriod, allowing you to adjust the duration of a full sun orbit between 0.1 and 2x the base value of 1200."
      ]
    },
    {
      "version": "0.1.1311.6385",
      "notes": [
        "First pass on atmosphere flowing between ship and main grid",
        "removed Altitude text from control chair that was causing errors",
        "Fixed mothership spawned by docking port from being made twice",
        "Fixed dock position when being created by mothership"
      ]
    },
    {
      "version": "0.1.1308.6377",
      "notes": [
        "Removed Placement effect because it was causing an error with windows. Will add again once fixed.",
        "Fixed Escape key not returning to the main menu if pressed on the new scenario screen.",
        "Fixed Instances of the tablet falling through voxel terrain by enabling the 'Small Item' flag on the object to enable additional collision detection.",
        "Added continuous collision detection for one second for items when they move to the world from a slot. This should help less things fall through the world."
      ]
    },
    {
      "version": "0.1.1307.6369",
      "notes": [
        "Fixed atmos thread crash when deconstructing multiple pipes.",
        "Added building effect for structures and build states"
      ]
    },
    {
      "version": "0.1.1305.6365",
      "notes": [
        "Fixed pressure gauge needle on Portable Air Scrubber rotating in the wrong direction.",
        "Fixed Raycaster camera being deleted on clients when the object it was attached to was destroyed."
      ]
    },
    {
      "version": "0.1.1303.6360",
      "notes": [
        "Fixed Increased idle power cost of Fabricator and Hydraulic Pipe Bender to bring them more in line with other manufacturing devices.",
        "Fixed the inability to rotate walls and floors in some orientations"
      ]
    },
    {
      "version": "0.1.1300.6356",
      "notes": [
        "Changed window settings so that the game can be visible in the background",
        "Fixed occasional NRE with ElectronicReader",
        "Fixed missing references to new e-reader lists in tutorial and world manager.",
        "Removed some debug entries on ladder.",
        "Added Electronic Reader Cartridge filtering.  Target any manufacturing machine, furnace or computer with manufacturing motherboard and it will only display the recipes relevant to that machine.",
        "Fixed ItemKitWall had wrong default thumbnail colour (orange instead of white).",
        "Fixed Tidied up several item kit names for consistency."
      ]
    },
    {
      "version": "0.1.1297.6349",
      "notes": [
        "Fixed issue where players were able to climb walls as long as they were looking at a ladder."
      ]
    },
    {
      "version": "0.1.1296.6347",
      "notes": [
        "Added ability to loop backwards through device and value selection on Logic READER by holding the QuantityModifier key (Left Alt by default).",
        "Fixed issue causing duplicate prefab errors on load for new wall variant kits.",
        "Fixed Iron Window's build state collider that was preventing passing though an unfinished iron window",
        "Fixed new wall prefab names"
      ]
    },
    {
      "version": "0.1.1293.6338",
      "notes": [
        "Fixed 3D printing material. Was supposed to be white",
        "Added first pass of Ladder.  Can be spawned in as an ItemKitLadder.  Currently need to be looking at a ladder to climb it, this will definitely be refined.  No recipe on crafting machines until it gets another pass.",
        "Added new wall types to 4 new kits. These kits can be built on the fabricator in the same way as the regular wall kit."
      ]
    },
    {
      "version": "0.1.1292.6332",
      "notes": [
        "Fixed Floor Grates can now be rotated on any axis.",
        "Made docking ports not spawnable",
        "Fixed missing localized name value for most recent frame variant (complete frame with corner removed).",
        "Fixed issue where CompositeRollCover did not return a door kit upon deconstruction."
      ]
    },
    {
      "version": "0.1.1291.6327",
      "notes": [
        "Fixed issue where the the sprite references on ItemKitPipe were incorrectly configured, meaning it always displayed the yellow thumbnail no matter what colour they were painted.",
        "Fixed NRE when ejecting silicon from fabricator. Added needed null check.",
        "Fixed Roll Cover placement. You were able to place it at all angles. Now it's just like other doors."
      ]
    },
    {
      "version": "0.1.1290.6322",
      "notes": [
        "Added RollCover \"Door\". You can build it using ItemKitDoor and place wires, pipes, and logic things inside it(they're actually placed on the frame behind it)"
      ]
    },
    {
      "version": "0.1.1289.6320",
      "notes": [
        "Fixed consoles not working in third person.",
        "Finished and added 3D printing shader for the Fabricator",
        "First pass on atmosphere flowing from main grid to mothership grid",
        "First pass on Mothership being created when you build a port side dock"
      ]
    },
    {
      "version": "0.1.1286.6311",
      "notes": [
        "Fixed issue with the select recipe screen in network games, where clicking the recipe selection button on a machine will trigger the popup on only the hosts machine.",
        "Fixed issue where the front of ItemDrill was missing."
      ]
    },
    {
      "version": "0.1.1285.6308",
      "notes": [
        "Fixed new wall kit fabricator recipe not being consistent with modified autolathe version.",
        "Fixed several outdated recycling recipes overriding the more up-to-date automated versions.",
        "Fixed Ingots now properly handled by new automated recycling recipe system and returning their original quantity as reagent mix."
      ]
    },
    {
      "version": "0.1.1284.6306",
      "notes": [
        "Fixed some input oddities when dealing with popup prompts like the new recipe selection dropdown and labeller window.  Can now use the chat key to submit the prompt, rather than cancel it.",
        "Fixed bug with interaction doesn't work intermittently on 3rd person camera.",
        "Added paintable mining belts."
      ]
    },
    {
      "version": "0.1.1281.6298",
      "notes": [
        "Fixed missing English language entry for ItemKitCompositeFloorGrating",
        "Added Paintable Toolbelt to replace existing one.",
        "Fixed exception when replacing cladding panel."
      ]
    },
    {
      "version": "0.1.1280.6295",
      "notes": [
        "Fixed UV issue with new Floor Grating Kit."
      ]
    },
    {
      "version": "0.1.1279.6292",
      "notes": [
        "Added new model for ItemKitCompositeFloorGrating that shows correct painted colour.",
        "Added automatic recycler recipes, so many items that were not previously recyclable should now be returning half their required ingredients.  Time to clean up those bases!",
        "Fixed error on load relating to incorrectly named property on floor gratings."
      ]
    },
    {
      "version": "0.1.1277.6286",
      "notes": [
        "Fixed bug where new light variants would cause errors when they were placed in the game due to sounds not being configured correctly.",
        "Changed Consolidated floor grating kits and new variants, so there's now only ItemKitCompositeFloorGrating.  Any instances of the old kit type will be converted to the new one on load.  Any existing instances of old floor gratings should also be replaced on load.  There may be a slight colour difference as the paintable ColorGray only approximately matches the old floor grating material.",
        "Changed Recipe cost for the old composite wall variant from 3 steel to 1 to better align the cost of completed walls vs frames."
      ]
    },
    {
      "version": "0.1.1274.6282",
      "notes": [
        "Fixed issue where player name was occasionally missing from messages about a player going unconscious, dying or respawning.",
        "Fixed issue constructing and deconstructing items on dedicated servers.",
        "Fixed bug with previous commit of Traditional Chinese localization file.",
        "Updated Localization strings for Japanese, Traditional Chinese and Spanish.",
        "Added new paintable, models for ItemKitWall and ItemKitWallIron that are now visually distinguishable from each other.",
        "Changed recipe for ItemKitWall.  As Windows can now be created with ItemKitWallIron and Iron alone, ItemKitWall is now crafted with Steel instead of Iron and Copper at both the Fabricator and Autolathe.",
        "Fixed Inconsistent tool application.  Windows and Railings final stages are now both deconstructed using the Angle Grinder.",
        "Fixed bug where new floor variants were not returning a kit.  Also, old floor variants should now return one of the new, paintable construction kits when deconstructed.",
        "Fixed bug where the select recipe button was useable even if the machine was not powered or switched on.",
        "Fixed bug where the select recipe menu would be stuck open without the cursor visible to interact with it if you were to press the escape key with it on-screen.",
        "Fixed visual issue with Organics Printer on/off switch clipping through the machine when in the off state.",
        "Fixed issue where the select menu button was not working on the Hydraulic Pipe Bender."
      ]
    },
    {
      "version": "0.1.1272.6268",
      "notes": [
        "Fixed active vents not working correctly when mode's been changed using logic. Using a Logic Writer to change mode on Active Vents should now correctly vent to the target pressure.",
        "fixed prefab name in the recipe for floor gratings",
        "Added plants will be bent when player step on them.",
        "Added grating and made them paintable",
        "Fixed ItemKitCompositeCladding reporting incorrect number of construction options.",
        "Fixed Data connection on Organics Printer pointing in the wrong direction.",
        "Added new models for Steel, Iron, Glass sheets.",
        "Added new models for Steel and Iron frames that properly display the colour they've been painted.",
        "Fixed Organics Printer now correctly returns an ItemKitOrganicsPrinter when deconstructed.",
        "Added iron window to the iron kit and changed the steel windows to require steel sheets"
      ]
    },
    {
      "version": "0.1.1271.6257",
      "notes": [
        "Added setting 'MouseWheelZoom' to the misc controls page, enabled by default.  This can be disabled to prevent the mouse wheel from being used to zoom in/out of third person camera mode.",
        "Fixed when plant grows it has wrong size on hydroponics tray.",
        "Added recipe for Fern to the Organics Printer.",
        "Fixed recipe for ItemKitOrganicsPrinter to remove Uranium so it can now be crafted.",
        "Fixed issue where recipe selection window would be stuck open if the crafting machine that invoked it lost power or if the player activates the chat window.",
        "Fixed Missing texture on Organics Printer glass windows.",
        "Fixed disabled mouse wheel for 3rd person camera activation when interaction panel enabled"
      ]
    },
    {
      "version": "0.1.1270.6252",
      "notes": [
        "Added Organics Printer.  Starting items that were previously irreplaceable (Plants, Eggs) can now be produced at the cost of large amounts of energy.  ItemKitOrganicsPrinter can now be produced in the Fabricator.  Still testing, expect bugs.",
        "Added Recipe Selection menu \"button\" to the right-side of the contents screen of most manufacturing machines.  This will bring up a drop-down menu that you can select a recipe from, rather than having to scroll through with the left and right arrows."
      ]
    },
    {
      "version": "0.1.1266.6240",
      "notes": [
        "Fixed more issues with the graphicsraycaster when deconstructing items"
      ]
    },
    {
      "version": "0.1.1265.6238",
      "notes": [
        "Fixed error with raycast camera when deconstructing an thing it is parented to.",
        "Fixed some errors while using consoles"
      ]
    },
    {
      "version": "0.1.1263.6234",
      "notes": [
        "Fixed issue with motherships returning to world origin when a world was completed on their grid."
      ]
    },
    {
      "version": "0.1.1262.6227",
      "notes": [
        "Reverted Structure control chair and added MyGraphicRaycaster to it",
        "reverted tablet prefab from commit 6213 to 5191 to fix the wrong screen position",
        "Added When players go unconscious, die or respawn all players will be notified via console entry.",
        "Added 3 new variants of wall lights (Long, Long Angled and Long Wide) available through the same ItemWallLight constructor as the existing wall lights."
      ]
    },
    {
      "version": "0.1.1261.6222",
      "notes": [
        "Fixed third person camera doesn't work when player sitting on chair.",
        "Fixed null ref caused in CursorManager by MyGraphicRaycaster",
        "Fixed error when attempting to deconstruct spherical corner cladding pieces."
      ]
    },
    {
      "version": "0.1.1259.6211",
      "notes": [
        "Fixed disappear wilted plant when reloaded.",
        "Added Third person camera, Can be activated with mouse wheel."
      ]
    },
    {
      "version": "0.1.1257.6203",
      "notes": [
        "Added docking port prefabs and animations",
        "Fixed SolidFuelGenerator max sound distance set to correct (much lower) value.",
        "Fixed collider for Composite Cladding Spherical Corner not being referenced correctly."
      ]
    },
    {
      "version": "0.1.1255.6192",
      "notes": [
        "Fixed wheat wriggling. Had the wrong shader applied to the material",
        "Fixed missing stars. The stars had been removed from the scene for some reason, they just needed adding back in."
      ]
    },
    {
      "version": "0.1.1254.6186",
      "notes": [
        "Fixed value not set on wall cooler construction kit preventing them from being placed."
      ]
    },
    {
      "version": "0.1.1253.6184",
      "notes": [
        "Fixed Server now synchronizes game mode with clients, so if modified manually in the save this change should now correctly propagate to clients."
      ]
    },
    {
      "version": "0.1.1252.6182",
      "notes": [
        "Fixed issue where machine inventories were not displaying portions of their contents correctly.",
        "Fixed NRE when player respawned while building mode.",
        "Fixed various visual issues with new Wall devices (Cooler, Heater, Lights)."
      ]
    },
    {
      "version": "0.1.1250.6175",
      "notes": [
        "Fixed bug with some recipes not recognizing the correct list of ingredients due to small floating point precision errors.",
        "Replaced models for WallCooler, WallHeater and WallLights.",
        "Fixed stuttering sounds of object on Mars.",
        "Fixed MaxVoltage value on 5-way Heavy Power Cable Junction.  Was 50k instead of 100k."
      ]
    },
    {
      "version": "0.1.1247.6166",
      "notes": [
        "Fixed dedicated server could play some kind of client sounds."
      ]
    },
    {
      "version": "0.1.1246.6163",
      "notes": [
        "Fixed 5-way heavy cables de-spawn on game reload"
      ]
    },
    {
      "version": "0.1.1241.6148",
      "notes": [
        "Fixed Missing cladding type now appears in the construction kit as an available option.",
        "Regenerated blueprints for cladding that had some graphical artefacts.",
        "Fixed collision box size for several cladding types."
      ]
    },
    {
      "version": "0.1.1240.6146",
      "notes": [
        "Added missing mirrored variant of long angled corner cladding.",
        "Added vertex shader to plants for slight movement",
        "Fixed console screen interactions flickering when moving quickly. Console buttons should now be able to be selected correctly on fast moving motherships.",
        "Fixed wilted plants being deleted immediately."
      ]
    },
    {
      "version": "0.1.1237.6132",
      "notes": [
        "Added 12 variants of cladding, a paintable, largely cosmetic outer layer for your base.  Blocks sunlight but not atmosphere.  Grouped into Angled, Cylindrical, Spherical and Rounded options.  Deconstructed using the Angle Grinder.  ItemKitCompositeCladding craftable in the Fabricator or Autolathe for 1 Iron per kit.",
        "Fixed bug where Iron Wall Kits were twice as expensive to manufacture in the Fabricator vs the Autolathe.",
        "Fixed collider issue on new CornerCut frame piece.",
        "Added Flags.  Small, paintable objects that remain visible for 2x the distance of frames, to make it easier to mark the way back to base in case your tracker runs out of power.  Craftable in the Tool Manufacturer and available in one of your starting crates.",
        "Fixed stars not appearing if switching from a mars map during the day to a moon or space map.",
        "Fixed bug where some actions would not be performed correctly if using SecondaryAction mapped to a key rather than a mouse button."
      ]
    },
    {
      "version": "0.1.1235.6122",
      "notes": [
        "First pass on dock for motherships - they work as airlocks currently except that if an airlock is on a mothership and gets close to a non-mothership airlock then it will auto align itself and move it to the docking position. This is probably not final behaviour.",
        "Added Corner Cut version of steel frames, the the last missing variant for the existing cosmetic frame corner options.",
        "Added new Skybox elements - Now there's stars and they move with the sun"
      ]
    },
    {
      "version": "0.1.1234.6112",
      "notes": [
        "Fixed bug where the quantity of food consumed would be removed from the item twice, resulting in consuming a full item rewarding no nutrition."
      ]
    },
    {
      "version": "0.1.1227.6101",
      "notes": [
        "Fixed issue with plants showing all growth states at once in storage or when dropped in world."
      ]
    },
    {
      "version": "0.1.1225.6098",
      "notes": [
        "Fixed Issue using chutes with Furnaces, Simple Fabricators and Stackers occasionally causing them to get jammed due to incorrect execution order. [Credit: Kamuchi]",
        "Fixed Issue where machines could occasionally output incorrectly sized stacks due to a rounding error. [Credit: Risu]",
        "Fixed Issue with slots on some objects not being occluded based on range correctly. [Credit: Risu]",
        "Fixed missing burnt cable reference for Heavy Cable 5-Way Junction.",
        "Added localization key for Burnt Heavy Cable 5-Way Junction.",
        "fixed spelling of pipe analyser",
        "Removed unused intro vidoes"
      ]
    },
    {
      "version": "0.1.1224.6093",
      "notes": [
        "Re-enabled flagging of items as out of bounds"
      ]
    },
    {
      "version": "0.1.1223.6091",
      "notes": [
        "Fixed Rocket Engines gauge needle rotating around the wrong axis. Needles on the rocket engine gauge should no longer rotate into it's face.",
        "Added missing normal and heavy cable variants (4-way and 5-way corners).",
        "Cable variant construction list order is now shared across both cable types.",
        "Fixed some inconsistencies around cable configuration and rotation restrictions.",
        "Fixed performance problem with ConsoleDebug - added an additional check before setting _fadingOut to true as it was always being set back to true."
      ]
    },
    {
      "version": "0.1.1218.6078",
      "notes": [
        "Fixed frame drop caused by garbage created by SolarPanel."
      ]
    },
    {
      "version": "0.1.1216.6070",
      "notes": [
        "Fixed Network Analyser now reports correct power usage values including draw from heating or battery charging etc. rather than just the base usage of the device itself."
      ]
    },
    {
      "version": "0.1.1215.6065",
      "notes": [
        "Fixed issue couldn't load broken save file caused by same reference ID of object.",
        "Added Manufacturing machines current recipe and job progress now persist through save/load."
      ]
    },
    {
      "version": "0.1.1214.6060",
      "notes": [
        "Fixed problem where stackers would occasionally back up by changing their order of execution."
      ]
    },
    {
      "version": "0.1.1212.6057",
      "notes": [
        "Fixed Skeletons will no longer decompose if flagged as Indestructible.",
        "Fixed Removed superfluous raycast on solar panels.",
        "Fixed issue calculating correct nutrition values to give from eating items.",
        "Fixed issue where consuming a whole piece of food at once would reward no nutrition."
      ]
    },
    {
      "version": "0.1.1210.6049",
      "notes": [
        "Added power used by individual devices to network analyser display in place of the 'Powered' message.",
        "Fixed Milk to now work with food consumption changes."
      ]
    },
    {
      "version": "0.1.1209.6046",
      "notes": [
        "Modified food consumption based on player feedback.  Each item now provides a set quantity of calories, and can be consumed in as small or large increments as you like, based on how long you hold down the SecondaryAction button.  You can no longer consume food beyond 100%.  Different foods contain varied amounts of calories and can be consumed at varying speeds, very roughly balanced around ingredients and complexity of production (likely to change).",
        "Fixed power usage value of reversed stacker so it uses as much as the default version."
      ]
    },
    {
      "version": "0.1.1208.6043",
      "notes": [
        "Fixed issue where clients would have issues joining dedicated servers running the Mars map."
      ]
    },
    {
      "version": "0.1.1205.6038",
      "notes": [
        "Fixed over stacking plants when harvesting, now they drop in the world instead",
        "Added random rotation to plants when they are plated",
        "Fixed issue with Disable Particles on Menu checkbox behaviour being inverted and not applying correctly on load.",
        "Fixed issue where manually entering a decimal value on a settings slider would result in an error."
      ]
    },
    {
      "version": "0.1.1203.6028",
      "notes": [
        "Fixed another couple of instances where sounds had incorrect MaxDistance values set and as a result could be heard much further away than intended."
      ]
    },
    {
      "version": "0.1.1202.6025",
      "notes": [
        "Fixed a bug with room data was not cleaned up when session ended.",
        "Fixed an issue atmosphere would exit when deleting Sleeper."
      ]
    },
    {
      "version": "0.1.1199.6020",
      "notes": [
        "Fixed bug with Scrubber not venting air when set to Open due to exceeded pressure error state. Now will vent even when completely full, if the lever is open.",
        "Added Portable Solar. When placed outside of inventory, the panels will open. A battery can be placed inside, and available sunlight will be used to slowly charge the battery. Can be constructed using the Electronics Printer, using similar resources to the large solar panel.",
        "Added Heavy Cable variant for 4-way corner piece. Constructable from Heavy Cable Coil.",
        "Changed heavy cable to models which were more distinct and fitting with aesthetic of the game.",
        "Added 3-way corner heavy cable model, in line with normal cable coil corner.",
        "Fixed out of focus main menu",
        "Added DOF to be removed when enabling menu lite option",
        "Fix construction cursor flickering when building walls and windows."
      ]
    },
    {
      "version": "0.1.1197.6007",
      "notes": [
        "Added Soy Oil that can be produced in the Reagent Processor from Soy Beans.",
        "Added Fries that can be made in the microwave using a Potato and a small quantity of Soy Oil. Provides a lot of calories.",
        "Added Baked Potato recipe. One potato can now be turned into a baked potato in the microwave, for more nutrition.",
        "Changed Portable Scrubber. Now will suck in all atmosphere when no filter is installed. Also added a level, when open, the internal atmosphere of the scrubber will be ejected into the world. This makes the scrubber more useful for different functions, such as clearing all of an atmosphere from a room on a planet."
      ]
    },
    {
      "version": "0.1.1196.6000",
      "notes": [
        "Added an option in misc settings to enable a bare bones menu with no particles",
        "Fixed issue with on/off sounds on Wall Heaters/Coolers MaxDistance setting, meaning they were always playing at full volume no matter where the player was in relation to them.  Let us know if you notice any other objects behaving in a similar way.",
        "Fixed Clients joining servers with custom global atmosphere. Client now receives the global gas mix during the joining phase"
      ]
    },
    {
      "version": "0.1.1195.5989",
      "notes": [
        "Fixed items and structures occluding when moving too fast. Things no longer flicker on and off when moving quickly on a mothership."
      ]
    },
    {
      "version": "0.1.1194.5987",
      "notes": [
        "Fixed self collision for all things in thing Awake",
        "Fixed construction tooltip while building on moving mothership",
        "Fixed motherships velocity is now correctly clamped. This value will probably change but it's set to the same as the player for now.",
        "Fixed motherships constantly pitching/yawing before snapping back to upright after collision.",
        "Fixed being unable to build on mothership while it's moving. Still some problems when the ship is rotating that need fixing.",
        "Fixed tooltips jittering on motherships.",
        "Fixed Active Vent missing box collider so could not be deconstructed. Now has correct collider."
      ]
    },
    {
      "version": "0.1.1193.5974",
      "notes": [
        "Fixed dynamic scrubbers not working in global atmospheres. Dynamic Scrubbers should now be able filter and trap gasses from global (e.g. Martian) atmospheres.",
        "Reverted global atmosphere per AtmosphericsController back to a single global atmosphere",
        "Fixed most interactions on moving motherships - Now using the interpolated RigidBody position with the camera offset added. Camera position wont work properly while the player is moving",
        "Added sun fading out at night time to reduce the occurrences of seeing the sun through the terrain and the terrain not casting shadows on objects",
        "Fixed HandleCollision doing excessive work - HandleCollisionsWith was being called multiple times on each structure and was doing it for each other structure. Removed pointless checks and added a magnitude distance check using the bounds of both objects to see if they could potentially be touching.",
        "Fixed items jittering when being pushed by a mothership. When their grid controller is changed to a mothership interpolation is enabled.",
        "Fixed issue where Asteroids in space were not visible after loading from save.",
        "Changed Active Vent model to new model, in line with other atmospheric item changes.",
        "Added first pass of new New World Menu including custom world settings screen.  Customizing some settings not yet supported, so consider it a work-in-progress for now."
      ]
    },
    {
      "version": "0.1.1192.5959",
      "notes": [
        "Fixed motherships using the main global atmosphere to using their own copy - still more work to be done on the mothership AtmosControl",
        "Fixed Tanks dynamic tanks in tank connectors colliding with motherships affecting the motherships movement",
        "Made Mothership be affected by Gravity",
        "Fixed NRE when fail to join server."
      ]
    },
    {
      "version": "0.1.1191.5952",
      "notes": [
        "Added new localization strings for Workshop page"
      ]
    },
    {
      "version": "0.1.1189.5948",
      "notes": [
        "Fixed creative mode setting not applying correctly from map presets."
      ]
    },
    {
      "version": "0.1.1188.5944",
      "notes": [
        "Fixed broken scene reference to Speech Recognizer.",
        "Changed Mars temperature to -60"
      ]
    },
    {
      "version": "0.1.1187.5938",
      "notes": [
        "Fixed issue where world settings were not being properly initialized if you started a second game without restarting the client.",
        "Fixed issue where world name was not being set correctly when loading a game.",
        "Disabled custom world parameters temporarily while a couple of server issues get resolved.",
        "Changed automatically assigned tags for workshop saved game submissions.",
        "Fixed stuttering introduced in 5919 by reverting some bad logic in WorldManager",
        "Fixed error when pressing the create world button without selecting an option. It now defaults to the moon world if no button was selected",
        "Fixed hunger no longer applies to characters inside a sleeper."
      ]
    },
    {
      "version": "0.1.1186.5926",
      "notes": [
        "Fixed holes in terrain caused by registering with incorrect neighbours",
        "Fixed incorrect mars atmosphere composition"
      ]
    },
    {
      "version": "0.1.1185.5924",
      "notes": [
        "Fixed items falling through terrain when loading a saved game caused by terrain not loading in properly around things",
        "Added World Settings are now saved out when the world is in worldsettings.xml.  When loading a game, if this file is not found it will fall back to the old method/presets.",
        "Moved world settings to XML. All world settings are now exposed in XML. This allows for adding custom world types and exposing the settings in game",
        "Added custom world generation parameters. It is now possible to define your own world terrain generation via XML",
        "Improved speed of terrain generation significantly through micro optimisations and removing unnecessary bounds checking when setting voxel.",
        "Fixed NRE by checking that CurrentBuildState is set before attempting to access its renderer.",
        "Fixed will now display default image if no mod preview image is provided."
      ]
    },
    {
      "version": "0.1.1183.5913",
      "notes": [
        "Replaced Passive Vent model with new model.",
        "Fixed cast bar getting stuck when consuming cereal bars too quickly.",
        "Fixed airlocks leaking atmosphere when internal doors are open. 1x1 rooms should no longer leak atmosphere.",
        "Missing material for baked potatoes."
      ]
    },
    {
      "version": "0.1.1181.5904",
      "notes": [
        "Fixed ore smelting gas always being output into world atmosphere. Now smelting gases in furnaces should output into connected pipe network again instead of world atmosphere."
      ]
    },
    {
      "version": "0.1.1179.5896",
      "notes": [
        "Added egg carton recipe for the fabricator",
        "Added Baked Potato."
      ]
    },
    {
      "version": "0.1.1178.5891",
      "notes": [
        "Fixed ice not melting in vacuum. Ice now melts either if it is in a warm enough atmosphere, or if it's in sunlight and not in a cold atmosphere - including vacuum.",
        "Fixed Open Workshop button on Workshop page to correctly take you to the page for the currently selected mod rather than the Stationeers workshop.",
        "Fixed bug where smelting would calculate the resulting gas mixture cumulatively for stacks of ore, resulting in huge quantities of gas being produced. [credit: Risu]",
        "Fixed water spreading. Water was not spreading after the global atmos update but has now been reintroduced and made to work with the global atmosphere system",
        "Fixed labeller cancel button not doing anything.",
        "Fixed Stairs being able to be built on top of eachother/other things - Stairs was overriding a wrapper method that wasn't being called wrapper method removed and override corrected",
        "Added an egg carton to the starting crate.",
        "Fixed DynamicGPR colliding with player when in an inventory slot - The item was tagged as \"CollidersAlwaysVisible\", should have been untagged",
        "Added Potatoes to starter crate."
      ]
    },
    {
      "version": "0.1.1176.5874",
      "notes": [
        "Fixed bug where status icons would not refresh properly when loading into a game where they should be visible."
      ]
    },
    {
      "version": "0.1.1175.5869",
      "notes": [
        "Removed buggy bedrock texture - the bedrock level is not making it's way to the shader correctly. This data is already being reworked in a coming update.",
        "Added decay state for chickens. Chicken corpses now disappear after a minute.",
        "Added new Hydroponics Tray model.",
        "Fixed accessing WorldAtmospheres adding a lock to GetAtmosphereLocal when accessing from outside the manager thread and redirecting all reading of WorldAtmosphere through GetAtmosphereLocal",
        "Added warning for waste tank when it is broken, and therefore will leak air.",
        "Added warning indicators and voice notification for Waste Tank. Now will disable warning when caution and critical, for either no waste tank existing, or over pressure. This helps avoid embarrassing instances where you have too much pressure in your waste tank and it explodes.",
        "Added Ore Scanning. An item can be made called a \"Ground Penetrating Radar\". When activated, it scans the surrounding area. Using a Ore Scanner Cartridge in your tablet will allow you to view the scanned data. These items can be built on the Electronics Printer. This will help you locate different kinds of ores without having to directly mine. Different types of ores have different colors on the scan results.",
        "Added voice notifications for Helmet Closed, and Helmet Opened. This will help avoid those embarrassing situations where you die because you pressed I and vented your breathing atmosphere into space, but didn't realize it was because your helmet was open."
      ]
    },
    {
      "version": "0.1.1173.5851",
      "notes": [
        "Fixed sounds of nearby structures in vacuum popping in and out while you're in a pressured room. Should no longer hear phantom sounds from machines in vacuum."
      ]
    },
    {
      "version": "0.1.1172.5847",
      "notes": [
        "Fixed radiators not working in vacuum. Radiators should now begin radiating heat again on the moon.",
        "Added new filter options in Join World menu. Incompatible versions are now hidden by default, along with options to hide password protected and empty servers. Other improvements have also been added to stop it from locking up while refreshing the server list.",
        "Tweaked some values for the quest panel in the tutorial. This should be a bit easier to read now.",
        "Fixed power connector not able to have portable generator wrenched onto it. Now can correctly wrench a portable generator to a power connector, to get generated power from it. Credit to Risu on Discord for solution.",
        "Fixed unable to change dynamic air conditioner's mode while wrenched onto tank connectors."
      ]
    },
    {
      "version": "0.1.1171.5834",
      "notes": [
        "Fixed duplicate atmosphere error causing atmospheric controller to crash",
        "Fixed null error on atmospheric things when entering rooms with no Atmosphere",
        "Fixed Soybeans never maturing and becoming harvestable."
      ]
    },
    {
      "version": "0.1.1168.5828",
      "notes": [
        "Added Hunger Rate to settings screen (temporarily).  Allows you to scale how fast your character gets hungry by 0-4x.  Not yet available for dedicated servers.",
        "Fixed ScreenFilter not clearing when loading mod data, preventing loading data more than once per launch.",
        "Added Mods now reload whenever you leave the workshop menu, allowing changes to be applied without relaunching the game.",
        "Fixed bug where large batteries in the mining drill were rotated in a way that meant you couldn't see their charge level."
      ]
    },
    {
      "version": "0.1.1167.5824",
      "notes": [
        "Added first pass of gas generator. Provides power from the gas combusted inside.",
        "Updated Hunger status icons",
        "Fixed NRE in dedicated server when stop server and press ESC button.",
        "Fixed some duplicate initializations when starting a new world",
        "Removed some unused ore game objects from WorldManager Prefab",
        "Removed old code for changing material on ores that was no longer needed"
      ]
    },
    {
      "version": "0.1.1166.5815",
      "notes": [
        "Fixed data disk slots incorrectly oriented on StructureComputer. DataDisks placed in a computer should now be rotated correctly. (Thanks Risu!)",
        "Fixed bug with APCs drawing more power than needed if charging nearly-full batteries. APC power draw now takes into account battery charge.",
        "First pass on global atmosphere system"
      ]
    },
    {
      "version": "0.1.1165.5810",
      "notes": [
        "Fixed NRE in tracker on dedicated server"
      ]
    },
    {
      "version": "0.1.1164.5807",
      "notes": [
        "Fixed issue where client didn't play WeldingTorch and MiningDrill sound when they activated.",
        "Added tag support for Steam Workshop mods.",
        "Fixed bug with some operating systems where the game couldn't determine voice control compatibility.",
        "Fixed bug where starting condition selection dropdown box could get into an infinite loop.",
        "Fix sync problem in out of sight objects. Client caches things information within 60m. When a thing is interpolating while in and out 60m, it can stunk if there is an obstacle between 2 positions. And it's properly tracking player who is out of 60m."
      ]
    },
    {
      "version": "0.1.1162.5798",
      "notes": [
        "Fixed non-latin languages not working on signs and pipe labels. Signs and labels should now show non-latin text correctly if the right game language is selected."
      ]
    },
    {
      "version": "0.1.1161.5796",
      "notes": [
        "Fixed missing nutrition warning voice messages and missing heath icons.",
        "Added Potato as growable (and edible) plant. Currently same growth stats as the wheat.",
        "Fixed Chutes ejecting contents during load. When a world was loaded chute contents (and possibly manufacturing devices as well) would eject their contents. Now they will continue to loop correctly. Note: this will only work with saves from now on. Old saves with items in chutes will eject their contents until they are resaved."
      ]
    },
    {
      "version": "0.1.1158.5789",
      "notes": [
        "Added cereal bars to your uniform slots in case you're starting a new multiplayer game with lots of players.",
        "Fixed issue where workshop mods would not be tagged as such if they were disabled.",
        "Updated readme and comment in ExampleMod.zip.",
        "Loading now skips items saved with invalid locations.",
        "Enabled Workshop Menu.",
        "Added ExampleMod.zip to the StreamingAssets folder.  See the readme.txt contained within for basic instructions on current mod support.",
        "Fixed saves loaded with dead characters were not given the option to respawn. Now the respawn dialogue correctly loads when player loads their game."
      ]
    },
    {
      "version": "0.1.1157.5783",
      "notes": [
        "Increased calorie storage for humans. A full stomach will last over one hour of playtime.",
        "Added Corn calorie value. Now corn will provide a small amount of calories when eaten.",
        "Increased Muffin calorie value. Only two bites of a muffin will provide full calorie storage for a player."
      ]
    },
    {
      "version": "0.1.1156.5777",
      "notes": [
        "Added new status icons for Hunger and Heath. Full, low, and critical food and health indicators appear and also include their current values.",
        "Fixed Damage states not being serialized. Now damage values for all things are included in save file and are correctly deserialized when loaded.",
        "Fixed total damage for entities incorrectly using body oxygen damage state when should use the brains oxygen damage state.",
        "Added milk, muffin, cereal bar, egg, and wheat as edible types. These can be eaten using secondary action, or force feed to another human using primary action.",
        "Fixed UnauthorizedAccessException when starting dedicated server in different path. It's caused by wrong initialization orders. You can run it in any path.",
        "Fixed bug where resetting controls to defaults was not saving the new keys correctly.",
        "Fixed wrong recipe index when server and client have different language settings. It's fixed in Autolathe, ElectronicsPrinter, HydraulicPipeBender, ToolManufactory, ScreenConstructionJob, ScreenFilter.",
        "Fixed issue where new implementation of starting equipment did not include Duct Tape.",
        "Added first pass of Hunger and Nutrition. If nutrition drops too low, player starts taking Starvation damage. Eat muffins or cereal bars to increase nutrition. More updates to follow with the new survival mechanics.",
        "Fixed issue where any progress panel displayed after the first would have no background.",
        "Updated upload progress prompt",
        "Fixed gas canisters disappearing when blown up. Canisters now remain in the world, in a blown up state."
      ]
    },
    {
      "version": "0.1.1155.5760",
      "notes": [
        "Fixed Game Settings heading in settings page not having a localized key.",
        "Changed StartingCrates definition to be generic for DynamicThings. Now includes definitions for AirConditioner and Scrubber.",
        "Added support for custom name and custom color in InventoryData and DynamicThingData, used with the ConditionData custom starting condition systems.",
        "Changed initial spawn items. Now air conditioner, scrubber, and beacon spawn with fully charged battery cells.",
        "Changed Starting Inventory and Starting Crates to be combined as a Starting Condition type. Different Starting Conditions can be loaded and, for now, appear as options in the Gameplay settings menu. This will be expanded to affect only new worlds, but for now, will affect any world running on the host. These can be made as mods.",
        "Updated Portuguese and Spanish localization files",
        "Fixed Players now start with the correct number of Iron Frames.",
        "Fixed Disconnecting from a game (or getting disconnected from a game) now closes any prompt that is up on screen.",
        "Fixed NRE when respawning"
      ]
    },
    {
      "version": "0.1.1151.5747",
      "notes": [
        "Fixed NRE when sending player state while disconnecting.",
        "Fixed starting equipment now gives you the correct number of cables.",
        "Reduced memory usages and connecting time. Client receives chunks data around own player when connecting. Explored chunks are cashed on client. It will be reset when you connecting. Server(host player, dedicated server) has all players' explored chunks."
      ]
    },
    {
      "version": "0.1.1150.5743",
      "notes": [
        "Updated Simplified Chinese localization"
      ]
    },
    {
      "version": "0.1.1149.5741",
      "notes": [
        "Added XML game data for player starting inventory. The StartingInventory game data list from XML contains references for what all players will have as starting inventory. This allows servers to run custom starting inventories for players. This is currently a global value, but will be subject to change to support scenarios in future.",
        "Added Skeleton's Ragdoll",
        "Fixed frames and other items spontaneously combusting when it shouldn't.",
        "Added Starting Crate data to XML. Basic starting crate data will now be configurable based on data contained in the StreamingAssets/Data XML file contents. This might be shifted into scenario data XML classes in later updates however so is subject to change.",
        "Added ReagentProcessor recipes to XML data format. Currently takes input prefab and output prefab. System to be extended to include quantity calculations in future.",
        "Added duplicate recipe check to Autolathe, ElectronicsPrinter and PipeBender for recipe mod support.",
        "Moved map upload progress bar to it's own window so more workshop functionality from map publishing can be used for mods."
      ]
    },
    {
      "version": "0.1.1148.5732",
      "notes": [
        "Added Japanese localization files",
        "Updated German, Spanish and Traditional Chinese localization files",
        "Fixed Atmospherics error when picking atmosphere to emit visualizer particle from.",
        "Fixed Large Gas Tank exceeding current maximum small grid allocation. Old max was 200 small grids, new max is 800 small grids."
      ]
    },
    {
      "version": "0.1.1145.5726",
      "notes": [
        "Added large tank, requiring 5x regular tank kits.  Takes up 8 grid squares (vs 1) and has a volume of 50000 (vs 6000)."
      ]
    },
    {
      "version": "0.1.1143.5721",
      "notes": [
        "Significantly improved terrain generation by splitting terrain features in to regions. Each voxel now only samples from close regions."
      ]
    },
    {
      "version": "0.1.1141.5717",
      "notes": [
        "Fixed NullReferenceException in updating grid information.",
        "Removed some unused calculations from the water shader",
        "Fixed the water connectivity calculations for the water VisualizerExtents",
        "Fixed water not dissipating in vacuum"
      ]
    },
    {
      "version": "0.1.1140.5711",
      "notes": [
        "Improved connecting time and added sync data progress. You might miss to progress it because small size of network messages are combined up to 100 messages.",
        "Fixed Steam AuthTicket Exception. When it happens, game will proceed to join. You'd better to restart game. It already lost steam connection."
      ]
    },
    {
      "version": "0.1.1135.5701",
      "notes": [
        "Updated New World menu thumbnails",
        "Upgraded Gas Display Circuitboard to connect to Gas Tank Storage. Gas Display now shows temperature and pressure of gas canisters stored in Gas Tank Storage.",
        "Added logic support to GasTankStorage. GasTankStorage now exposes it's held gas tank's atmosphere data (pressure, temperature etc) on the logic network."
      ]
    },
    {
      "version": "0.1.1133.5689",
      "notes": [
        "Updated German, Spanish and Traditional Chinese localization files.",
        "Fixed wall heaters not drawing enough power. Wall heaters now draw 1005w of power when working.",
        "Fixed gas display displaying wrong values when it exceeded 999. Now updates the unity under the value to be correct."
      ]
    },
    {
      "version": "0.1.1132.5681",
      "notes": [
        "Fixed Atmos leaking bug",
        "Added support for localizing unmined mineral names."
      ]
    },
    {
      "version": "0.1.1130.5676",
      "notes": [
        "Fixed Player's weird movement when you unconsious or dead.",
        "Deleted invisible body on decay and respawn (if decayed)",
        "Fixed IndexOutOfRangeException when you create Moon and then create Space. One of necessary variable wasn't initialized when switch world."
      ]
    },
    {
      "version": "0.1.1128.5668",
      "notes": [
        "removed water visualizer when using openGL"
      ]
    },
    {
      "version": "0.1.1127.5663",
      "notes": [
        "removed water visualizer when using DX9 due to lack of compute shader support",
        "added a fallback for the terrain shader to the standard shader for dx9",
        "Updated Korean and German language files"
      ]
    },
    {
      "version": "0.1.1126.5657",
      "notes": [
        "Added OpenGLCore to Graphics APIs for someone who has crash in related to video car and driver. It can be enabled with -force-glcore parameter."
      ]
    },
    {
      "version": "0.1.1124.5651",
      "notes": [
        "Added support for Japanese translation.",
        "Added support for Korean translation.",
        "Fixed broken atmosphere on game client. It usually happened before sync dropped item, tried to update atmosphere in multiplay. It broke atmospheres of all items. Now that, it shouldn't be broken in any case.",
        "Fixed floating point numbers log spam. It happened when infinite floating numbers set in rotation of Inverse Kinematics. Now it doesn't use wrong value in rotation."
      ]
    },
    {
      "version": "0.1.1122.5642",
      "notes": [
        "Replaced Gas Tank Storage model. Same dimensions. Also has a data port, so you can read values from it using the logic system.",
        "Fixed Air Conditioner operation flawed. Community provided new coded solution. Credit to Illiux who did math for heat-pump, ???Zaneo for providing advice for direction, and Dimitri for the actual code. Heat-pump calculates per tick power cost of energy transfer when heating and cooling. Additionally energy from pump work is added to waste or output, because of this heating cost a bit less then cooling. Cost of energy transfer and amount of additional energy added is calculated using Coefficient of Performance?."
      ]
    },
    {
      "version": "0.1.1121.5639",
      "notes": [
        "Added support for Simplified Chinese. Along with Simplified Chinese translation files.",
        "Fixed unreadable tips on loading screen when using a CJK font.",
        "Fixed dialog boxes showing squares in some languages.",
        "Updated German, Spanish and Traditional Chinese translation files.",
        "Added support for kick and ban messages for servers hosted via dedicated server or full client."
      ]
    },
    {
      "version": "0.1.1120.5635",
      "notes": [
        "Fixed tablets not working when loading with them in player inventory. They were not being correctly initialized on player locality change. Now they will correctly reinitialize when a player takes control of a entity.",
        "Added Fixed Beacon. This is a placeable structure that requires 300W of power, but broadcasts its location. This can be accessed via the Tracker Cartridge, just like normal beacons. It can be built using the Electrical Printer.",
        "Fixed connection problem when there are hundreds of linked devices including Logic reader/writer, filter, Circuitboard, LogicMotherboard. It didn't check message buffers size when sending sync data. It usually stuck in applying chunks data 90%-100%. You can join server that it was fixed."
      ]
    },
    {
      "version": "0.1.1119.5631",
      "notes": [
        "Fixed Join World button is disabled when player returns join menu from game.",
        "Fixed Inactive ServerListItem Animators being called when disabled. causing lag on player load",
        "Eyes should now correctly close when you die",
        "Fixed writing decimals to logic memory unit from logic computers"
      ]
    },
    {
      "version": "0.1.1117.5624",
      "notes": [
        "Added Traditional Chinese localization.",
        "Added more missing strings for localization including the Change Appearance screen.",
        "Fixed missing EntryTools for Chair, Turret and engines.",
        "Fixed truncate chatting text when it's full. It will scroll properly."
      ]
    },
    {
      "version": "0.1.1114.5617",
      "notes": [
        "Fixed items being invisible when viewing your own dead body after re-spawning",
        "Fixed error when disabling shadows on re-spawn",
        "Added skeleton despawning after 60 seconds.",
        "Fixed re-spawn while in decayed State(wasn't working at all)",
        "Fixed some dropped items being invisible(because they were still on the wrong layer)",
        "Removed all shadows of dead players",
        "Avoided possible divide by zero in cell charger. (Thanks Risu!)",
        "Fixed ores not appearing on load for play host players",
        "Updated localization files for German, Russian, Spanish and French"
      ]
    },
    {
      "version": "0.1.1113.5609",
      "notes": [
        "Fixed NRE in CameraCollisionHandler. It failed to join server on a certain pc because of delay to initial camera. It makes you join server properly.",
        "Fixed battery charger distributing power to charged batteries. Now the charger only adds charge to batteries that aren't full. (Thanks Risu!)"
      ]
    }
  ]
}
